


MMUSIC Working Group                                         C. Holmberg
Internet-Draft                                                  Ericsson
Updates: 3264 (if approved)                                H. Alvestrand
Intended status: Standards Track                                  Google
Expires: June 16, 2018                                       C. Jennings
                                                                   Cisco
                                                       December 13, 2017


 Negotiating Media Multiplexing Using the Session Description Protocol
                                 (SDP)
            draft-ietf-mmusic-sdp-bundle-negotiation-44.txt

Abstract

   This specification defines a new Session Description Protocol (SDP)
   Grouping Framework extension, 'BUNDLE'.  The extension can be used
   with the SDP Offer/Answer mechanism to negotiate the usage of a
   single transport (5-tuple) for sending and receiving media described
   by multiple SDP media descriptions ("m=" sections).  Such transport
   is referred to as a BUNDLE transport, and the media is referred to as
   bundled media.  The "m=" sections that use the BUNDLE transport form
   a BUNDLE group.

   To assist endpoints in negotiating the use of bundle this
   specification defines a new SDP attribute, 'bundle-only', which can
   be used to request that specific media is only used if bundled.  The
   specification also updates RFC 3264, to allow assigning a zero port
   value to a "m=" section without meaning that the media described by
   the "m=" section is disabled or rejected.

   When RTP-based media is used, there are multiple ways to correlate
   bundled RTP packets with the appropriate "m=" section.  This
   specification defines a new Real-time Transport Control Protocol
   (RTCP) source description (SDES) item and a new RTP header extension
   that provides an additional way to do this correlation by using them
   to carry a value that associates the RTP/RTCP packets with a specific
   "m=" section.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.



Holmberg, et al.          Expires June 16, 2018                 [Page 1]

Internet-Draft                Bundled media                December 2017


   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on June 16, 2018.

Copyright Notice

   Copyright (c) 2017 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

   This document may contain material from IETF Documents or IETF
   Contributions published or made publicly available before November
   10, 2008.  The person(s) controlling the copyright in some of this
   material may not have granted the IETF Trust the right to allow
   modifications of such material outside the IETF Standards Process.
   Without obtaining an adequate license from the person(s) controlling
   the copyright in such materials, this document may not be modified
   outside the IETF Standards Process, and derivative works of it may
   not be created outside the IETF Standards Process, except to format
   it for publication as an RFC or to translate it into languages other
   than English.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   6
   3.  Conventions . . . . . . . . . . . . . . . . . . . . . . . . .   7
   4.  Applicability Statement . . . . . . . . . . . . . . . . . . .   7
   5.  SDP Grouping Framework BUNDLE Extension . . . . . . . . . . .   7
   6.  SDP 'bundle-only' Attribute . . . . . . . . . . . . . . . . .   8
   7.  SDP Information Considerations  . . . . . . . . . . . . . . .   9
     7.1.  Connection Data (c=)  . . . . . . . . . . . . . . . . . .   9
     7.2.  Bandwidth (b=)  . . . . . . . . . . . . . . . . . . . . .   9
   8.  SDP Offer/Answer Procedures . . . . . . . . . . . . . . . . .   9
     8.1.  Mux Category Considerations . . . . . . . . . . . . . . .  10
     8.2.  Generating the Initial SDP Offer  . . . . . . . . . . . .  11



Holmberg, et al.          Expires June 16, 2018                 [Page 2]

Internet-Draft                Bundled media                December 2017


       8.2.1.  Suggesting the Offerer BUNDLE Address . . . . . . . .  12
       8.2.2.  Example: Initial SDP Offer  . . . . . . . . . . . . .  12
     8.3.  Generating the SDP Answer . . . . . . . . . . . . . . . .  13
       8.3.1.  Answerer Selection of Offerer BUNDLE Address  . . . .  14
       8.3.2.  Answerer Selection of Answerer BUNDLE Address . . . .  15
       8.3.3.  Moving A Media Description Out Of A BUNDLE Group  . .  15
       8.3.4.  Rejecting a Media Description in a BUNDLE Group . . .  16
       8.3.5.  Example: SDP Answer . . . . . . . . . . . . . . . . .  17
     8.4.  Offerer Processing of the SDP Answer  . . . . . . . . . .  17
     8.5.  Modifying the Session . . . . . . . . . . . . . . . . . .  18
       8.5.1.  Suggesting a New Offerer BUNDLE Address . . . . . . .  18
       8.5.2.  Adding a Media Description to a BUNDLE group  . . . .  18
       8.5.3.  Moving a Media Description Out of a BUNDLE Group  . .  19
       8.5.4.  Disabling a Media Description in a BUNDLE Group . . .  19
   9.  Protocol Identification . . . . . . . . . . . . . . . . . . .  20
     9.1.  STUN, DTLS, SRTP  . . . . . . . . . . . . . . . . . . . .  20
   10. RTP Considerations  . . . . . . . . . . . . . . . . . . . . .  21
     10.1.  Single RTP Session . . . . . . . . . . . . . . . . . . .  21
       10.1.1.  Payload Type (PT) Value Reuse  . . . . . . . . . . .  22
     10.2.  Associating RTP/RTCP Streams with Correct SDP Media
            Description  . . . . . . . . . . . . . . . . . . . . . .  22
     10.3.  RTP/RTCP Multiplexing  . . . . . . . . . . . . . . . . .  28
       10.3.1.  SDP Offer/Answer Procedures  . . . . . . . . . . . .  28
   11. ICE Considerations  . . . . . . . . . . . . . . . . . . . . .  30
     11.1.  SDP Offer/Answer Procedures  . . . . . . . . . . . . . .  31
   12. DTLS Considerations . . . . . . . . . . . . . . . . . . . . .  31
   13. RTP Header Extensions Consideration . . . . . . . . . . . . .  32
   14. Update to RFC 3264  . . . . . . . . . . . . . . . . . . . . .  32
     14.1.  Original text of section 5.1 (2nd paragraph) of RFC 3264  33
     14.2.  New text replacing section 5.1 (2nd paragraph) of RFC
            3264 . . . . . . . . . . . . . . . . . . . . . . . . . .  33
     14.3.  Original text of section 6 (4th paragraph) of RFC 3264 .  33
     14.4.  New text replacing section 6 (4th paragraph) of RFC 3264  34
     14.5.  Original text of section 8.2 (2nd paragraph) of RFC 3264  34
     14.6.  New text replacing section 8.2 (2nd paragraph) of RFC
            3264 . . . . . . . . . . . . . . . . . . . . . . . . . .  34
     14.7.  Original text of section 8.4 (6th paragraph) of RFC 3264  34
     14.8.  New text replacing section 8.4 (6th paragraph) of RFC
            3264 . . . . . . . . . . . . . . . . . . . . . . . . . .  34
   15. RTP/RTCP extensions for identification-tag transport  . . . .  35
     15.1.  RTCP MID SDES Item . . . . . . . . . . . . . . . . . . .  36
     15.2.  RTP SDES Header Extension For MID  . . . . . . . . . . .  36
   16. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  37
     16.1.  New SDES item  . . . . . . . . . . . . . . . . . . . . .  37
     16.2.  New RTP SDES Header Extension URI  . . . . . . . . . . .  37
     16.3.  New SDP Attribute  . . . . . . . . . . . . . . . . . . .  38
     16.4.  New SDP Group Semantics  . . . . . . . . . . . . . . . .  38
   17. Security Considerations . . . . . . . . . . . . . . . . . . .  39



Holmberg, et al.          Expires June 16, 2018                 [Page 3]

Internet-Draft                Bundled media                December 2017


   18. Examples  . . . . . . . . . . . . . . . . . . . . . . . . . .  40
     18.1.  Example: Bundle Address Selection  . . . . . . . . . . .  40
     18.2.  Example: BUNDLE Extension Rejected . . . . . . . . . . .  42
     18.3.  Example: Offerer Adds a Media Description to a BUNDLE
            Group  . . . . . . . . . . . . . . . . . . . . . . . . .  43
     18.4.  Example: Offerer Moves a Media Description Out of a
            BUNDLE Group . . . . . . . . . . . . . . . . . . . . . .  45
     18.5.  Example: Offerer Disables a Media Description Within a
            BUNDLE Group . . . . . . . . . . . . . . . . . . . . . .  47
   19. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  48
   20. Change Log  . . . . . . . . . . . . . . . . . . . . . . . . .  49
   21. References  . . . . . . . . . . . . . . . . . . . . . . . . .  59
     21.1.  Normative References . . . . . . . . . . . . . . . . . .  59
     21.2.  Informative References . . . . . . . . . . . . . . . . .  61
   Appendix A.  Design Considerations  . . . . . . . . . . . . . . .  62
     A.1.  UA Interoperability . . . . . . . . . . . . . . . . . . .  63
     A.2.  Usage of Port Number Value Zero . . . . . . . . . . . . .  64
     A.3.  B2BUA And Proxy Interoperability  . . . . . . . . . . . .  65
       A.3.1.  Traffic Policing  . . . . . . . . . . . . . . . . . .  65
       A.3.2.  Bandwidth Allocation  . . . . . . . . . . . . . . . .  65
     A.4.  Candidate Gathering . . . . . . . . . . . . . . . . . . .  66
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  66

1.  Introduction

   When multimedia communications are established, each transport
   (5-tuple) reserved for an individual media stream consume additional
   resources (especially when Interactive Connectivity Establishment
   (ICE) [I-D.ietf-ice-rfc5245bis] is used).  For this reason, it is
   attractive to use a single transport for multiple media streams.

   This specification defines a way to use a single transport (BUNDLE
   transport) for sending and receiving media (bundled media) described
   by multiple SDP media descriptions ("m=" sections).  The same BUNDLE
   transport is used for sending and receiving bundled media, which
   means that the symmetric RTP mechanism [RFC4961] is always used for
   RTP-based bundled media.

   This specification defines a new SDP Grouping Framework [RFC5888]
   extension called 'BUNDLE'.  The extension can be used with the
   Session Description Protocol (SDP) Offer/Answer mechanism [RFC3264]
   to negotiate which "m=" sections will become part of a BUNDLE group.
   Within a BUNDLE group, each "m=" section will use a BUNDLE transport
   for sending and receiving bundled media.

   Within a BUNDLE group, each endpoint uses a single address:port
   combination for sending and receiving bundled media.  The
   address:port combination is referred to as the BUNDLE address.  In



Holmberg, et al.          Expires June 16, 2018                 [Page 4]

Internet-Draft                Bundled media                December 2017


   addition to negotiating the BUNDLE group, the offerer and answerer
   [RFC3264] use the BUNDLE extension to negotiate the BUNDLE addresses,
   one for the offerer (offerer BUNDLE address) and one for the answerer
   (answerer BUNDLE address).  Once the offerer and the answerer have
   negotiated the BUNDLE addresses, and a BUNDLE group has been formed,
   they assign their respective BUNDLE address to each "m=" section
   within the BUNDLE group.  The endpoints then use the BUNDLE addresses
   for sending and receiving the bundled media associated with the
   BUNDLE group.

   The use of a BUNDLE transport also allows the usage of a single set
   of Interactive Connectivity Establishment (ICE)
   [I-D.ietf-ice-rfc5245bis] candidates for the whole BUNDLE group.

   This specification also defines a new SDP attribute, 'bundle-only',
   which can be used to request that specific media is only used if the
   "m=" section describing the media is kept within a BUNDLE group.  The
   specification also updates RFC 3264, to allow usage of zero port
   values without meaning that media is rejected.

   As defined in RFC 4566 [RFC4566], the semantics of assigning the same
   transport address (IP address and port) to multiple "m=" sections are
   undefined, and there is no grouping defined by such means.  Instead,
   an explicit grouping mechanism needs to be used to express the
   intended semantics.  This specification provides such an extension.

   This specification also updates sections 5.1, 8.1 and 8.2 of RFC 3264
   [RFC3264].  The update allows an answerer to assign a non-zero port
   value to an "m=" section in an SDP answer, even if the "m=" section
   in the associated SDP offer contained a zero port value.

   This specification also defines a new Real-time Transport Protocol
   (RTP) [RFC3550] source description (SDES) item, 'MID', and a new RTP
   SDES header extension that can be used to associate RTP streams with
   "m=" sections.

   SDP bodies can contain multiple BUNDLE groups.  A given BUNDLE
   address MUST only be associated with a single BUNDLE group.  The
   procedures in this specification apply independently to a given
   BUNDLE group.  All RTP based media flows described by a single BUNDLE
   group belong to a single RTP session [RFC3550].

   The BUNDLE extension is backward compatible.  Endpoints that do not
   support the extension are expected to generate offers and answers
   without an SDP 'group:BUNDLE' attribute, and are expected to assign a
   unique address to each "m=" section within an offer and answer,
   according to the procedures in [RFC4566] and [RFC3264].




Holmberg, et al.          Expires June 16, 2018                 [Page 5]

Internet-Draft                Bundled media                December 2017


2.  Terminology

   "m=" section: SDP bodies contain one or more media descriptions,
   referred to as "m=" sections.  Each "m=" section is represented by an
   SDP "m=" line, and zero or more SDP attributes associated with the
   "m=" line.  A local address:port combination is assigned to each "m="
   section.

   5-tuple: A collection of the following values: source address, source
   port, destination address, destination port, and transport-layer
   protocol.

   Unique address: An address:port combination that is assigned to only
   one "m=" section in an offer or answer.

   Offerer BUNDLE-tag: The first identification-tag in a given SDP
   'group:BUNDLE' attribute identification-tag list in an offer.

   Answerer BUNDLE-tag: The first identification-tag in a given SDP
   'group:BUNDLE' attribute identification-tag list in an answer.

   BUNDLE address: An address:port combination that an endpoint uses for
   sending and receiving bundled media.

   Offerer BUNDLE address: the address:port combination used by the
   offerer for sending and receiving media.

   Suggested Offerer BUNDLE address: before an offerer BUNDLE address
   has been selected by the answerer, or when the offerer wants to
   change a previously selected offerer BUNDLE address, the address:port
   combination that the offerer wants to use for sending and receiving
   media.  While suggested by the offerer, the selection of the offerer
   BUNDLE address is done by the answerer.

   Answerer BUNDLE address: the address:port combination used by the
   answerer for sending and receiving media.

   BUNDLE transport: The transport (5-tuple) used by all media described
   by the "m=" sections within a BUNDLE group.

   BUNDLE group: A set of "m=" sections, created using an SDP Offer/
   Answer exchange, which uses a single BUNDLE transport for sending and
   receiving all media (bundled media) described by the set of "m="
   sections.  The same BUNDLE transport is used for sending and
   receiving bundled media.






Holmberg, et al.          Expires June 16, 2018                 [Page 6]

Internet-Draft                Bundled media                December 2017


   Bundled "m=" section: An "m=" section, whose identification-tag is
   placed in an SDP 'group:BUNDLE' attribute identification-tag list in
   an offer or answer.

   Bundle-only "m=" section: A bundled "m=" section that contains an SDP
   'bundle-only' attribute.

   Bundled media: All media associated with a given BUNDLE group.

   Initial offer: The first offer, within an SDP session (e.g. a SIP
   dialog when the Session Initiation Protocol (SIP) [RFC3261] is used
   to carry SDP), in which the offerer indicates that it wants to create
   a given BUNDLE group.

   Subsequent offer: An offer which contains a BUNDLE group that has
   been created as part of a previous offer/answer exchange.

   Identification-tag: A unique token value that is used to identify an
   "m=" section.  The SDP 'mid' attribute [RFC5888] in an "m=" section
   carries the unique identification-tag assigned to that "m=" section.
   The session-level SDP 'group' attribute [RFC5888] carries a list of
   identification-tags, identifying the "m=" sections associated with
   that particular 'group' attribute.

3.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14, RFC 2119
   [RFC2119].

4.  Applicability Statement

   The mechanism in this specification only applies to the Session
   Description Protocol (SDP) [RFC4566], when used together with the SDP
   offer/answer mechanism [RFC3264].  Declarative usage of SDP is out of
   scope of this document, and is thus undefined.

5.  SDP Grouping Framework BUNDLE Extension

   This section defines a new SDP Grouping Framework [RFC5888]
   extension, 'BUNDLE'.  The BUNDLE extension can be used with the SDP
   Offer/Answer mechanism to negotiate a set of "m=" sections that will
   become part of a BUNDLE group.  Within a BUNDLE group, each "m="
   section will use a BUNDLE transport for sending and receiving bundled
   media.  Each endpoint uses a single address:port combination for
   sending and receiving the bundled media.




Holmberg, et al.          Expires June 16, 2018                 [Page 7]

Internet-Draft                Bundled media                December 2017


   The BUNDLE extension is indicated using an SDP 'group' attribute with
   a "BUNDLE" semantics value [RFC5888].  An identification-tag is
   assigned to each bundled "m=" section, and each identification-tag is
   listed in the SDP 'group:BUNDLE' attribute identification-tag list.
   Each "m=" section whose identification-tag is listed in the
   identification-tag list is associated with a given BUNDLE group.

   SDP bodies can contain multiple BUNDLE groups.  Any given bundled
   "m=" section MUST NOT be associated with more than one BUNDLE group
   at any given time.

   NOTE: The order of the "m=" sections listed in the SDP 'group:BUNDLE'
   attribute identification-tag list does not have to be the same as the
   order in which the "m=" sections occur in the SDP.

   Section 8 defines the detailed SDP Offer/Answer procedures for the
   BUNDLE extension.

6.  SDP 'bundle-only' Attribute

   This section defines a new SDP media-level attribute [RFC4566],
   'bundle-only'. 'bundle-only' is a property attribute [RFC4566], and
   hence has no value.


      Name: bundle-only

      Value: N/A

      Usage Level: media

      Charset Dependent: no

      Example:

        a=bundle-only


   In order to ensure that an answerer that does not support the BUNDLE
   extension always rejects a bundled "m=" section, the offerer can
   assign a zero port value to the "m=" section.  According to [RFC3264]
   an answerer will reject such an "m=" section.  By including an SDP
   'bundle-only' attribute in such an "m=" section, the offerer can
   request that the answerer accepts the "m=" section if the answerer
   supports the BUNDLE extension, and if the answerer keeps the "m="
   section within the associated BUNDLE group.





Holmberg, et al.          Expires June 16, 2018                 [Page 8]

Internet-Draft                Bundled media                December 2017


   Once the offerer and answerer BUNDLE addresses have been selected, an
   offerer and answerer only assign the BUNDLE address to one bundled
   "m=" section.  The offerer and answerer assign a zero port value and
   includes an SDP 'bundle-only' attribute to every other bundled "m="
   section.

   The usage of the 'bundle-only' attribute is only defined for a
   bundled "m=" section with a zero port value.  Other usage is
   unspecified.

   Section 8 defines the detailed SDP Offer/Answer procedures for the
   'bundle-only' attribute.

7.  SDP Information Considerations

   This section describes restrictions associated with the usage of SDP
   parameters within a BUNDLE group.  It also describes how to calculate
   a value for the whole BUNDLE group, when parameter and attribute
   values have been assigned to each bundled "m=" section.

7.1.  Connection Data (c=)

   The "c=" line nettype value [RFC4566] associated with a bundled "m="
   section MUST be 'IN'.

   The "c=" line addrtype value [RFC4566] associated with a bundled "m="
   section MUST be 'IP4' or 'IP6'.  The same value MUST be associated
   with each "m=" section.

   NOTE: Extensions to this specification can specify usage of the
   BUNDLE mechanism for other nettype and addrtype values than the ones
   listed above.

7.2.  Bandwidth (b=)

   An offerer and answerer MUST use the rules and restrictions defined
   in [I-D.ietf-mmusic-sdp-mux-attributes] for associating the SDP
   bandwidth (b=) line with bundled "m=" sections.

8.  SDP Offer/Answer Procedures

   This section describes the SDP Offer/Answer [RFC3264] procedures for:

   o  Negotiating a BUNDLE group; and

   o  Selecting the BUNDLE addresses (offerer BUNDLE address and
      answerer BUNDLE address); and




Holmberg, et al.          Expires June 16, 2018                 [Page 9]

Internet-Draft                Bundled media                December 2017


   o  Adding an "m=" section to a BUNDLE group; and

   o  Moving an "m=" section out of a BUNDLE group; and

   o  Disabling an "m=" section within a BUNDLE group.

   The generic rules and procedures defined in [RFC3264] and [RFC5888]
   also apply to the BUNDLE extension.  For example, if an offer is
   rejected by the answerer, the previously negotiated SDP parameters
   and characteristics (including those associated with a BUNDLE group)
   apply.  Hence, if an offerer generates an offer in which the offerer
   wants to create a BUNDLE group, and the answerer rejects the offer,
   the BUNDLE group is not created.

   The procedures in this section are independent of the media type or
   "m=" line proto value assigned to a bundled "m=" section.  Section 10
   defines additional considerations for RTP based media.  Section 6
   defines additional considerations for the usage of the SDP 'bundle-
   only' attribute.  Section 11 defines additional considerations for
   the usage of Interactive Connectivity Establishment (ICE)
   [I-D.ietf-ice-rfc5245bis] mechanism.

   SDP offers and answers can contain multiple BUNDLE groups.  The
   procedures in this section apply independently to a given BUNDLE
   group.

8.1.  Mux Category Considerations

   When a BUNDLE group is initially negotiated, and a unique address is
   assigned to each bundled "m=" section (excluding any bundle-only "m="
   section) in the initial offer [Section 8.2], IDENTICAL and TRANSPORT
   mux category SDP attributes MUST explicitly be included in each
   bundled "m=" section (excluding any bundle-only "m=" sections).

   When an offerer or answerer includes SDP attributes in bundled "m="
   sections within a BUNDLE group for which the offerer and answerer
   BUNDLE addresses have been selected, IDENTICAL and TRANSPORT mux
   category SDP attributes [I-D.ietf-mmusic-sdp-mux-attributes] are only
   included in the "m=" section represented by the BUNDLE-tag in the
   offer or answer.  The SDP attribute values are implicitly applied to
   each bundled "m=" section (including any bundle-only "m=" section).
   The offerer and answerer MUST NOT include such SDP attributes in any
   other bundled "m=" section.

   The semantics of some SDP attributes only apply to specific types of
   media.  For example, the semantics of the SDP 'rtcp-mux' and SDP
   'rtcp-mux-only' attributes only apply to "m=" sections describing
   RTP-based media.  However, as described in Section 8.1, there are



Holmberg, et al.          Expires June 16, 2018                [Page 10]

Internet-Draft                Bundled media                December 2017


   cases where IDENTICAL and TRANSPORT mux category SDP attributes are
   only included in the "m=" sections represented by the BUNDLE-tag.
   That means that media-specific IDENTICAL and TRANSPORT mux category
   attributes can be included in an "m=" section associated with another
   type of media.

8.2.  Generating the Initial SDP Offer

   When an offerer generates an initial offer, to negotiate a BUNDLE
   group, it MUST:

   o  Assign a unique address to each "m=" section within the offer,
      following the procedures in [RFC3264], excluding any bundle-only
      "m=" sections (see below); and

   o  Include an SDP 'group:BUNDLE' attribute in the offer; and

   o  Place the identification-tag of each bundled "m=" section in the
      SDP 'group:BUNDLE' attribute identification-tag list; and

   o  Indicate which unique address the offerer suggests as the offerer
      BUNDLE address [Section 8.2.1].

   If the offerer wants to request that the answerer accepts a given
   bundled "m=" section only if the answerer keeps the "m=" section
   within the BUNDLE group, the offerer MUST:

   o  Include an SDP 'bundle-only' attribute [Section 8.2.1] in the "m="
      secction; and

   o  Assign a zero port value to the "m=" section.

   NOTE: If the offerer assigns a zero port value to an "m=" section,
   but does not include an SDP 'bundle-only' attribute in the "m="
   section, it is an indication that the offerer wants to disable the
   "m=" section [Section 8.5.4].

   NOTE: If the offerer assigns unique addresses to multiple bundled
   "m=" sections, the offerer needs to be prepared to receive bundled
   media on each unique address, until it receives the associated answer
   and finds out which address:port combination has been selected as the
   offerer BUNDLE-address.

   [Section 8.2.2] and [Section 18.1] show an example of an initial
   offer.






Holmberg, et al.          Expires June 16, 2018                [Page 11]

Internet-Draft                Bundled media                December 2017


8.2.1.  Suggesting the Offerer BUNDLE Address

   In the offer, the address:port combination assigned to the "m="
   section represented by the offerer BUNDLE-tag indicates the offerer
   BUNDLE address, i.e., the address:port combination that the offerer
   suggests for sending and receiving bundled media.

   The offerer BUNDLE-tag MUST NOT represent a bundle-only "m=" section.
   Hence, the offer MUST contain at least one bundled "m=" section with
   a unique address (and a non-zero port value).

   It is RECOMMENDED that the offerer assigns the suggested offerer
   BUNDLE address to a bundled "m=" section that the offerer assumes it
   is unlikely that the answerer will reject, or move out of the BUNDLE
   group.  How such assumption is made is outside the scope of this
   document.

8.2.2.  Example: Initial SDP Offer

   The example shows an initial SDP offer.  The offer includes two "m="
   sections in the SDP, and suggests that both are included in a BUNDLE
   group.  The audio "m=" section is represented by the offerer BUNDLE-
   tag (placed first in the SDP group:BUNDLE attribute identification-id
   list).



























Holmberg, et al.          Expires June 16, 2018                [Page 12]

Internet-Draft                Bundled media                December 2017


   SDP Offer

     v=0
     o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
     s=
     c=IN IP4 atlanta.example.com
     t=0 0
     a=group:BUNDLE foo bar
     m=audio 10000 RTP/AVP 0 8 97
     b=AS:200
     a=mid:foo
     a=rtcp-mux
     a=rtpmap:0 PCMU/8000
     a=rtpmap:8 PCMA/8000
     a=rtpmap:97 iLBC/8000
     a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
     m=video 10002 RTP/AVP 31 32
     b=AS:1000
     a=mid:bar
     a=rtcp-mux
     a=rtpmap:31 H261/90000
     a=rtpmap:32 MPV/90000
     a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


8.3.  Generating the SDP Answer

   When an answerer generates an answer that contains a BUNDLE group,
   the following general SDP grouping framework restrictions, defined in
   [RFC5888], also apply to the BUNDLE group:

   o  The answerer MUST NOT include a BUNDLE group in the answer, unless
      the offerer requested the BUNDLE group to be negotiated in the
      corresponding offer; and

   o  The answerer MUST NOT include an "m=" section within a BUNDLE
      group, unless the offerer requested the "m=" section to be within
      that BUNDLE group in the corresponding offer.

   o  If the answer contains multiple BUNDLE groups, the answerer MUST
      NOT move an "m=" section from one BUNDLE group to another.

   If the answer contains a BUNDLE group, the answerer MUST:

   o  Select an offerer BUNDLE Address [Section 8.3.1]; and

   o  Select an answerer BUNDLE Address [Section 8.3.2].




Holmberg, et al.          Expires June 16, 2018                [Page 13]

Internet-Draft                Bundled media                December 2017


   The answerer is allowed to select a new answerer BUNDLE address each
   time it generates an answer to an offer.

   If the answerer does not want to keep an "m=" section within a BUNDLE
   group, it MUST:

   o  Move the "m=" section out of the BUNDLE group [Section 8.3.3]; or

   o  Reject the "m=" section [Section 8.3.4].

   When the answerer creates the answer, it selects the offerer BUNDLE
   address [Section 8.3.1] and the answerer BUNDLE address
   [Section 8.3.2].  The answerer then assigns the answerer BUNDLE
   address to the bundled "m=" section represented by the answerer
   BUNDLE-tag.  In every other bundled "m=" section the answerer
   includes an SDP 'bundle-only' attribute and assigns a zero port value
   to the "m=" section.

   If the answerer does not want to keep a bundle-only "m=" section
   within the BUNDLE group, it MUST reject the "m=" section
   [Section 8.3.4].

   NOTE: If a bundled "m=" section in an offer contains a zero port
   value, but the "m=" section does not contain an SDP 'bundle-only'
   attribute, it is an indication that the offerer wants to disable the
   "m=" section [Section 8.5.4].

8.3.1.  Answerer Selection of Offerer BUNDLE Address

   In an offer, the bundled "m=" section represented by the offerer
   BUNDLE-tag contains the suggested offerer BUNDLE address, i.e, the
   address:port combination that the offerer wants to use for sending
   and receiving bundled media [Section 8.2.1].  The answerer MUST check
   whether that "m=" section fulfils the following criteria:

   o  The answerer will not move the "m=" section out of the BUNDLE
      group [Section 8.3.3]; and

   o  The answerer will not reject the "m=" section [Section 8.3.4]; and

   o  The "m=" section does not contain a zero port value.

   If all of the criteria above are fulfilled, the answerer MUST select
   the suggested offerer BUNDLE address.

   If one or more of the criteria are not fulfilled, the answerer MUST
   pick the next identification-tag in the identification-tag list in
   the offer, and perform the same criteria check for the "m=" section



Holmberg, et al.          Expires June 16, 2018                [Page 14]

Internet-Draft                Bundled media                December 2017


   represented by that identification-tag.  If there are no more
   identification-tags in the identification-tag list, the answerer MUST
   NOT create the BUNDLE group.  Unless the answerer rejects the whole
   offer, the answerer MUST apply the answerer procedures for moving an
   "m=" section out of a BUNDLE group [Section 8.3.3] or rejecting an
   "m=" section within a BUNDLE group [Section 8.3.4] to every bundled
   "m=" section in the offer when creating the answer.

   [Section 18.1] shows an example of an offerer BUNDLE address
   selection.

8.3.2.  Answerer Selection of Answerer BUNDLE Address

   When the answerer selects a BUNDLE address for itself (answerer
   BUNDLE address), the answerer MUST assign the answerer BUNDLE address
   to the "m=" section that contains the selected offerer BUNDLE address
   in the corresponding offer.  The answerer BUNDLE-tag represents that
   "m=" section in the answer.  To every other bundled "m=" section the
   answerer MUST assign a zero port value and include an SDP 'bundle-
   only' attribute.

   The answerer MUST NOT assign an answerer BUNDLE address to an "m="
   section that is not within the BUNDLE group, or to an "m=" section
   that is within another BUNDLE group.

   [Section 8.3.5] and [Section 18.1] show an example of an answerer
   BUNDLE address selection.

8.3.3.  Moving A Media Description Out Of A BUNDLE Group

   When an answerer wants to move a bundled "m=" section out of a BUNDLE
   group in an answer, it MUST first check the following criteria:

   o  In the corresponding offer, an offerer BUNDLE address (previously
      selected [Section 8.3.1] or new suggested [Section 8.5.1]) has
      been assigned to the "m=" section by the offerer; or

   o  In the corresponding offer, the "m=" section contains an SDP
      'bundle-only' attribute and a zero port value.

   If either criteria above is fulfilled, the answerer can not move the
   "m=" section out of the BUNDLE group in the answer.  The answerer can
   either reject the whole offer, reject each bundled "m=" section
   within the BUNDLE group [Section 8.3.4], or keep the "m=" section
   within the BUNDLE group in the answer and later create an offer where
   the "m=" section is moved out of the BUNDLE group [Section 8.5.3].





Holmberg, et al.          Expires June 16, 2018                [Page 15]

Internet-Draft                Bundled media                December 2017


   When the answerer generates an answer, in which it moves a bundled
   "m=" section out of a BUNDLE group, the answerer:

   o  MUST assign a unique address to the "m=" section; and

   o  MUST NOT place the identification-tag associated with the "m="
      section in the SDP 'group:BUNDLE' attribute identification-tag
      list associated with the BUNDLE group; and

   o  MUST NOT assign an SDP 'bundle-only' attribute to the "m="
      section.

   An answerer MUST NOT move an "m=" section from one BUNDLE group to
   another within an answer.  If the answerer wants to move an "m="
   section from one BUNDLE group to another it MUST first move the "m="
   section out of the current BUNDLE group, and then generate an offer
   where the "m=" section is added to another BUNDLE group
   [Section 8.5.2].

8.3.4.  Rejecting a Media Description in a BUNDLE Group

   When an answerer wants to reject a bundled "m=" section in an answer,
   it MUST first check the following criteria:

   o  In the corresponding offer, an offerer BUNDLE address (previously
      selected [Section 8.3.1] or new suggested [Section 8.5.1]) has
      been assigned to the "m=" section by the offerer.

   If the criteria above is fulfilled, the answerer can not reject the
   "m=" section in the answer (unless the answerer rejects each bundled
   "m=" section within the BUNDLE group).  The answerer can either
   reject the whole offer, reject each bundled "m=" section within the
   BUNDLE group, or keep the "m=" section within the BUNDLE group in the
   answer and later create an offer where the "m=" section is disabled
   within the BUNDLE group [Section 8.5.4].

   When an answerer generates an answer, in which it rejects a bundled
   "m=" section, the answerer:

   o  MUST assign a zero port value to the "m=" section, according to
      the procedures in [RFC3264]; and

   o  MUST NOT place the identification-tag associated with the "m="
      section in the SDP 'group:BUNDLE' attribute identification-tag
      list associated with the BUNDLE group; and

   o  MUST NOT assign an SDP 'bundle-only' attribute to the "m="
      section.



Holmberg, et al.          Expires June 16, 2018                [Page 16]

Internet-Draft                Bundled media                December 2017


8.3.5.  Example: SDP Answer

   The example below shows an SDP answer, based on the SDP offer in
   [Section 8.2.2].  The answerer accepts both "m=" sections within the
   BUNDLE group.  The answerer assigns the answerer BUNDLE address to
   the "m=" section represented by the answerer BUNDLE-tag.  The
   answerer assigns a zero port value and an SDP 'bundle-only' attribute
   to the other bundled "m=" section.


   SDP Answer

     v=0
     o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
     s=
     c=IN IP4 biloxi.example.com
     t=0 0
     a=group:BUNDLE foo bar
     m=audio 20000 RTP/AVP 0
     b=AS:200
     a=mid:foo
     a=rtcp-mux
     a=rtpmap:0 PCMU/8000
     a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
     m=video 0 RTP/AVP 32
     b=AS:1000
     a=mid:bar
     a=bundle-only
     a=rtpmap:32 MPV/90000
     a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid



8.4.  Offerer Processing of the SDP Answer

   When an offerer receives an answer, if the answer contains a BUNDLE
   group, the offerer MUST check that any bundled "m=" section in the
   answer was indicated as bundled in the corresponding offer.  If there
   is no mismatch, the offerer MUST use the offerer BUNDLE address,
   selected by the answerer [Section 8.3.1], as the address for each
   bundled "m=" section.

   NOTE: As the answerer might reject one or more bundled "m=" sections,
   or move a bundled "m=" section out of a BUNDLE group, each bundled
   "m=" section in the offer might not be indicated as bundled in the
   answer.





Holmberg, et al.          Expires June 16, 2018                [Page 17]

Internet-Draft                Bundled media                December 2017


   If the answer does not contain a BUNDLE group, the offerer MUST
   process the answer as a normal answer.

8.5.  Modifying the Session

   When an offerer generates a subsequent offer (i.e., a BUNDLE group
   has previously been negotiated), it MUST assign the previously
   selected offer BUNDLE address [Section 8.3.1], or a new suggested
   offerer BUNDLE address [Section 8.5.1], to exactly one "m=" section
   within the BUNDLE group.

   The offerer MUST NOT assign an offerer BUNDLE address (previously
   selected [Section 8.3.1] or new suggested [Section 8.5.1]) to a
   bundled "m=" section if:

   o  The offerer wants to move the bundled "m=" section out of the
      BUNDLE group [Section 8.5.3]; or

   o  The offerer wants to disable the bundled "m=" section
      [Section 8.5.4].

   To every other "m=" section within the BUNDLE group, the offerer MUST
   assign a zero port value and an SDP 'bundle-only' attribute.

   When the offerer generates a subsequent offer, the offerer BUNDLE-tag
   MUST represent the bundled "m=" section to which the offerer BUNDLE
   address (previously negotiated or new suggested) has been assigned.

8.5.1.  Suggesting a New Offerer BUNDLE Address

   When an offerer generates an offer, in which it suggests a new
   offerer BUNDLE address [Section 8.2.1], the offerer MUST:

   o  Assign the new suggested offerer BUNDLE address to exactly one
      "m=" section within the BUNDLE group; and

   o  Assign a zero port value and an SDP 'bundle-only' attribute to
      every other "m=" section within the BUNDLE group.

8.5.2.  Adding a Media Description to a BUNDLE group

   When an offerer generates an offer, in which it wants to add a
   bundled "m=" section, the offerer MUST:

   o  Assign the offerer BUNDLE address (previously selected
      [Section 8.3.1] or new suggested [Section 8.5.1]) to the added
      "m=" section; or




Holmberg, et al.          Expires June 16, 2018                [Page 18]

Internet-Draft                Bundled media                December 2017


   o  Assign a zero port value and an SDP 'bundle-only' attribute to the
      added "m=" section (in this case the offerer BUNDLE address is
      assigned to another "m=" section within the BUNDLE group).

   In addition, the offerer MUST place the identification-tag associated
   with the added "m=" section in the SDP 'group:BUNDLE' attribute
   identification-tag list associated with the BUNDLE group
   [Section 8.2.1].

   NOTE: If the offerer also wants to suggest a new offerer BUNDLE
   address to the BUNDLE group, the offerer can assign the new suggested
   offerer BUNDLE address either to the added "m=" section, or to some
   other "m=" section within the BUNDLE group [Section 8.5.1].

   [Section 18.3] shows an example where an offerer sends an offer in
   order to add a bundled "m=" section to a BUNDLE group.

8.5.3.  Moving a Media Description Out of a BUNDLE Group

   When an offerer generates an offer, in which it wants to move a
   bundled "m=" section out of a BUNDLE group, the offerer:

   o  MUST assign a unique address to the "m=" section; and

   o  MUST NOT place the identification-tag associated with the "m="
      section in the SDP 'group:BUNDLE' attribute identification-tag
      list associated with the BUNDLE group; and

   o  MUST NOT assign an SDP 'bundle-only' attribute to the "m="
      section.

   An offerer MUST NOT move an "m=" section from one BUNDLE group to
   another within a single offer.  If the offerer wants to move an "m="
   section from one BUNDLE group to another it MUST first move the
   BUNDLE group out of the current BUNDLE group, and then generate a
   second offer where the "m=" section is added to another BUNDLE group
   [Section 8.5.2].

   [Section 18.4] shows an example of an offer for moving an "m="
   section out of a BUNDLE group.

8.5.4.  Disabling a Media Description in a BUNDLE Group

   When an offerer generates an offer, in which it wants to disable a
   bundled "m=" section, the offerer:

   o  MUST assign a zero port value to the "m=" section, following the
      procedures in [RFC4566]; and



Holmberg, et al.          Expires June 16, 2018                [Page 19]

Internet-Draft                Bundled media                December 2017


   o  MUST NOT place the identification-tag associated with the "m="
      section in the SDP 'group:BUNDLE' attribute identification-tag
      list associated with the BUNDLE group; and

   o  MUST NOT assign an SDP 'bundle-only' attribute to the "m="
      section.

   [Section 18.5] shows an example of an offer and answer for disabling
   an "m=" section within a BUNDLE group.

9.  Protocol Identification

   Each "m=" section within a BUNDLE group MUST use the same transport-
   layer protocol.  If bundled "m=" sections use different protocols on
   top of the transport-layer protocol, there MUST exist a publicly
   available specification which describes a mechanism how to associate
   received data with the correct protocol for this particular protocol
   combination.

   In addition, if received data can be associated with more than one
   bundled "m=" section, there MUST exist a publicly available
   specification which describes a mechanism for associating the
   received data with the correct "m=" section.

   This document describes a mechanism to identify the protocol of
   received data among the STUN, DTLS and SRTP protocols (in any
   combination), when UDP is used as transport-layer protocol, but it
   does not describe how to identify different protocols transported on
   DTLS.  While the mechanism is generally applicable to other protocols
   and transport-layer protocols, any such use requires further
   specification around how to multiplex multiple protocols on a given
   transport-layer protocol, and how to associate received data with the
   correct protocols.

9.1.  STUN, DTLS, SRTP

   Section 5.1.2 of [RFC5764] describes a mechanism to identify the
   protocol of a received packet among the STUN, DTLS and SRTP protocols
   (in any combination).  If an offer or answer includes a bundled "m="
   section that represents these protocols, the offerer or answerer MUST
   support the mechanism described in [RFC5764], and no explicit
   negotiation is required in order to indicate support and usage of the
   mechanism.

   [RFC5764] does not describe how to identify different protocols
   transported on DTLS, only how to identify the DTLS protocol itself.
   If multiple protocols are transported on DTLS, there MUST exist a
   specification describing a mechanism for identifying each individual



Holmberg, et al.          Expires June 16, 2018                [Page 20]

Internet-Draft                Bundled media                December 2017


   protocol.  In addition, if a received DTLS packet can be associated
   with more than one "m=" section, there MUST exist a specification
   which describes a mechanism for associating the received DTLS packets
   with the correct "m=" section.

   [Section 10.2] describes how to associate the packets in a received
   SRTP stream with the correct "m=" section.

10.  RTP Considerations

10.1.  Single RTP Session

   All RTP-based media within a single BUNDLE group belong to a single
   RTP session [RFC3550].

   Since a single BUNDLE transport is used for sending and receiving
   bundled media, the symmetric RTP mechanism [RFC4961] MUST be used for
   RTP-based bundled media.

   Since a single RTP session is used for each BUNDLE group, all "m="
   sections representing RTP-based media within a BUNDLE group will
   share a single SSRC numbering space [RFC3550].

   The following rules and restrictions apply for a single RTP session:

   o  A specific payload type value can be used in multiple bundled "m="
      sections only if each codec associated with the payload type
      number shares an identical codec configuration [Section 10.1.1].

   o  The proto value in each bundled RTP-based "m=" section MUST be
      identical (e.g., RTP/AVPF).

   o  The RTP MID header extension MUST be enabled, by including an SDP
      'extmap' attribute [RFC8285], with a 'urn:ietf:params:rtp-
      hdrext:sdes:mid' URI value, in each bundled RTP-based "m=" section
      in every offer and answer.

   o  A given SSRC MUST NOT transmit RTP packets using payload types
      that originate from different bundled "m=" sections.

   NOTE: The last bullet above is to avoid sending multiple media types
   from the same SSRC.  If transmission of multiple media types are done
   with time overlap, RTP and RTCP fail to function.  Even if done in
   proper sequence this causes RTP Timestamp rate switching issues
   [RFC7160].  However, once an SSRC has left the RTP session (by
   sending an RTCP BYE packet), that SSRC can be reused by another
   source (possibly associated with a different bundled "m=" section)
   after a delay of 5 RTCP reporting intervals (the delay is to ensure



Holmberg, et al.          Expires June 16, 2018                [Page 21]

Internet-Draft                Bundled media                December 2017


   the SSRC has timed out, in case the RTCP BYE packet was lost
   [RFC3550]).

10.1.1.  Payload Type (PT) Value Reuse

   Multiple bundled "m=" sections might describe RTP based media.  As
   all RTP based media associated with a BUNDLE group belong to the same
   RTP session, in order for a given payload type value to be used
   inside more than one bundled "m=" section, all codecs associated with
   the payload type number MUST share an identical codec configuration.
   This means that the codecs MUST share the same media type, encoding
   name, clock rate and any parameter that can affect the codec
   configuration and packetization.
   [I-D.ietf-mmusic-sdp-mux-attributes] lists SDP attributes, whose
   attribute values must be identical for all codecs that use the same
   payload type value.

10.2.  Associating RTP/RTCP Streams with Correct SDP Media Description

   As described in [RFC3550], RTP packets are associated with RTP
   streams [RFC7656].  Each RTP stream is identified by an SSRC value,
   and each RTP packet includes an SSRC field that is used to associate
   the packet with the correct RTP stream.  RTCP packets also use SSRCs
   to identify which RTP streams the packet relates to.  However, a RTCP
   packet can contain multiple SSRC fields, in the course of providing
   feedback or reports on different RTP streams, and therefore can be
   associated with multiple such streams.

   In order to be able to process received RTP/RTCP packets correctly,
   it must be possible to associate an RTP stream with the correct "m="
   section, as the "m=" section and SDP attributes associated with the
   "m=" section contains information needed to process the packets.

   As all RTP streams associated with a BUNDLE group use the same
   transport for sending and receiving RTP/RTCP packets, the local
   address:port combination part of the transport cannot be used to
   associate an RTP stream with the correct "m=" section.  In addition,
   multiple RTP streams might be associated with the same "m=" section.

   An offerer and answerer can inform each other which SSRC values they
   will use for an RTP stream by using the SDP 'ssrc' attribute
   [RFC5576].  However, an offerer will not know which SSRC values the
   answerer will use until the offerer has received the answer providing
   that information.  Due to this, before the offerer has received the
   answer, the offerer will not be able to associate an RTP stream with
   the correct "m=" section using the SSRC value associated with the RTP
   stream.  In addition, the offerer and answerer may start using new




Holmberg, et al.          Expires June 16, 2018                [Page 22]

Internet-Draft                Bundled media                December 2017


   SSRC values mid-session, without informing each other using the SDP
   'ssrc' attribute.

   In order for an offerer and answerer to always be able to associate
   an RTP stream with the correct "m=" section, the offerer and answerer
   using the BUNDLE extension MUST support the mechanism defined in
   Section 15, where the offerer and answerer insert the identification-
   tag associated with an "m=" section (provided by the remote peer)
   into RTP and RTCP packets associated with a BUNDLE group.

   When using this mechanism, the mapping from an SSRC to an
   identification-tag is carried in RTP header extensions or RTCP SDES
   packets, as specified in Section 15.  Since a compound RTCP packet
   can contain multiple RTCP SDES packets, and each RTCP SDES packet can
   contain multiple chunks, a single RTCP packet can contain several
   SSRC to identification-tag mappings.  The offerer and answerer
   maintain tables used for routing that are updated each time an RTP/
   RTCP packet contains new information that affects how packets should
   be routed.

   However, some implementations may not include this identification-tag
   in their RTP and RTCP traffic when using the BUNDLE mechanism, and
   instead use a payload type based mechanism to associate RTP streams
   with SDP "m=" sections.  In this situation, each "m=" section MUST
   use unique payload type values, in order for the payload type to be a
   reliable indicator of the relevant "m=" section for the RTP stream.
   Note that when using the payload type to associate RTP streams with
   "m=" sections an RTP stream, identified by its SSRC, will be mapped
   to an "m=" section when the first packet of that RTP stream is
   received, and the mapping will not be changed even if the payload
   type used by that RTP stream changes.  In other words, the SSRC
   cannot "move" to a different "m=" section simply by changing the
   payload type.

   Applications can implement RTP stacks in many different ways.  The
   algorithm below details one way that RTP streams can be associated
   with "m=" sections, but is not meant to be prescriptive about exactly
   how an RTP stack needs to be implemented.  Applications MAY use any
   algorithm that achieves equivalent results to those described in the
   algorithm below.

   To prepare to associate RTP streams with the correct "m=" section,
   the following steps MUST be followed for each BUNDLE group:

      Construct a table mapping MID to "m=" section for each "m="
      section in this BUNDLE group.  Note that an "m=" section may only
      have one MID.




Holmberg, et al.          Expires June 16, 2018                [Page 23]

Internet-Draft                Bundled media                December 2017


      Construct a table mapping SSRCs of incoming RTP streams to "m="
      section for each "m=" section in this BUNDLE group and for each
      SSRC configured for receiving in that "m=" section.

      Construct a table mapping the SSRC of each outgoing RTP stream to
      "m=" section for each "m=" section in this BUNDLE group and for
      each SSRC configured for sending in that "m=" section.

      Construct a table mapping payload type to "m=" section for each
      "m=" section in the BUNDLE group and for each payload type
      configured for receiving in that "m=" section.  If any payload
      type is configured for receiving in more than one "m=" section in
      the BUNDLE group, do not include it in the table, as it cannot be
      used to uniquely identify an "m=" section.

      Note that for each of these tables, there can only be one mapping
      for any given key (MID, SSRC, or PT).  In other words, the tables
      are not multimaps.

   As "m=" sections are added or removed from the BUNDLE groups, or
   their configurations are changed, the tables above MUST also be
   updated.

   When an RTP packet is received, it MUST be delivered to the RTP
   stream corresponding to its SSRC.  That RTP stream MUST then be
   associated with the correct "m=" section within a BUNDLE group, for
   additional processing, according to the following steps:

      If the MID associated with the RTP stream is not in the table
      mapping MID to "m=" section, then the RTP stream is not decoded
      and the payload data is discarded.

      If the packet has a MID, and the packet's extended sequence number
      is greater than that of the last MID update, as discussed in
      [RFC7941], Section 4.2.6, update the MID associated with the RTP
      stream to match the MID carried in the RTP packet, then update the
      mapping tables to include an entry that maps the SSRC of that RTP
      stream to the "m=" section for that MID.

      If the SSRC of the RTP stream is in the incoming SSRC mapping
      table, check that the payload type used by the RTP stream matches
      a payload type included on the matching "m=" section.  If so,
      associate the RTP stream with that "m=" section.  Otherwise, the
      RTP stream is not decoded and the payload data is discarded.

      If the payload type used by the RTP stream is in the payload type
      table, update the incoming SSRC mapping table to include an entry
      that maps the RTP stream's SSRC to the "m=" section for that



Holmberg, et al.          Expires June 16, 2018                [Page 24]

Internet-Draft                Bundled media                December 2017


      payload type.  Associate the RTP stream with the corresponding
      "m=" section.

      Otherwise, mark the RTP stream as not for decoding and discard the
      payload.

   If the RTP packet contains one or more contributing source (CSRC)
   identifiers, then each CSRC is looked up in the incoming SSRC table
   and a copy of the RTP packet is associated with the corresponding
   "m=" section for additional processing.

   For each RTCP packet received (including each RTCP packet that is
   part of a compound RTCP packet), the packet is processed as usual by
   the RTP layer, then passed to the "m=" sections corresponding to the
   RTP streams it contains information about for additional processing.
   This routing is type-dependent, as each kind of RTCP packet has its
   own mechanism for associating it with the relevant RTP streams.

   RTCP packets for which no appropriate "m=" section can be identified
   MUST be processed as usual by the RTP layer, updating the metadata
   associated with the corresponding RTP streams, but are not passed to
   any "m=" section.  This situation can occur with certain multiparty
   RTP topologies, or when RTCP packets are sent containing a subset of
   the SDES information.

   Rules for additional processing of the various types of RTCP packets
   are explained below.

      If the RTCP packet is of type SDES, for each chunk in the packet
      whose SSRC is found in the incoming SSRC table, deliver a copy of
      the SDES packet to the "m=" section associated with that SSRC.  In
      addition, for any SDES MID items contained in these chunks, if the
      MID is found in the table mapping MID to "m=" section, update the
      incoming SSRC table to include an entry that maps the RTP stream
      associated with the chunk's SSRC to the "m=" section associated
      with that MID, unless the packet is older than the packet that
      most recently updated the mapping for this SSRC, as discussed in
      [RFC7941], Section 4.2.6.

      Note that if an SDES packet is received as part of a compound RTCP
      packet, the SSRC to "m=" section mapping may not exist until the
      SDES packet is handled (e.g., in the case where RTCP for a source
      is received before any RTP packets).  Therefore, when processing a
      compound packet, any contained SDES packet MUST be handled first.
      Note that this is a change from [RFC3550] Section 6.1, which
      states that "Each individual RTCP packet in the compound packet
      may be processed independently with no requirements upon the order
      or combination of packets".



Holmberg, et al.          Expires June 16, 2018                [Page 25]

Internet-Draft                Bundled media                December 2017


      If the RTCP packet is of type BYE, it indicates that the RTP
      streams referenced in the packet are ending.  Therefore, for each
      SSRC indicated in the packet that is found in the incoming SSRC
      table, first deliver a copy of the BYE packet to the "m=" section
      associated with that SSRC, then remove the entry for that SSRC
      from the incoming SSRC table after an appropriate delay to account
      for "straggler packets", as specified in [RFC3550], Section 6.2.1.

      If the RTCP packet is of type SR or RR, for each report block in
      the report whose "SSRC of source" is found in the outgoing SSRC
      table, deliver a copy of the SR or RR packet to the "m=" section
      associated with that SSRC.  In addition, if the packet is of type
      SR, and the sender SSRC for the packet is found in the incoming
      SSRC table, deliver a copy of the SR packet to the "m=" section
      associated with that SSRC.

      If the implementation supports RTCP XR and the packet is of type
      XR, as defined in [RFC3611], for each report block in the report
      whose "SSRC of source" is found in the outgoing SSRC table,
      deliver a copy of the XR packet to the "m=" section associated
      with that SSRC.  In addition, if the sender SSRC for the packet is
      found in the incoming SSRC table, deliver a copy of the XR packet
      to the "m=" section associated with that SSRC.

      If the RTCP packet is a feedback message of type RTPFB or PSFB, as
      defined in [RFC4585], it will contain a media source SSRC, and
      this SSRC is used for routing certain subtypes of feedback
      messages.  However, several subtypes of PSFB and RTPFB messages
      include target SSRC(s) in a section called Feedback Control
      Information (FCI).  For these messages, the target SSRC(s) are
      used for routing.

      If the RTCP packet is a feedback packet that does not include
      target SSRCs in its FCI section, and the media source SSRC is
      found in the outgoing SSRC table, deliver the feedback packet to
      the "m=" section associated with that SSRC.  RTPFB and PSFB types
      that are handled in this way include:

      Generic NACK:  [RFC4585] (PT=RTPFB, FMT=1).

      Picture Loss Indication (PLI):  [RFC4585] (PT=PSFB, FMT=1).

      Slice Loss Indication (SLI):  [RFC4585] (PT=PSFB, FMT=2).

      Reference Picture Selection Indication (RPSI):  [RFC4585]
         (PT=PSFB, FMT=3).





Holmberg, et al.          Expires June 16, 2018                [Page 26]

Internet-Draft                Bundled media                December 2017


      If the RTCP packet is a feedback message that does include target
      SSRC(s) in its FCI section, it can either be a request or a
      notification.  Requests reference a RTP stream that is being sent
      by the message recipient, whereas notifications are responses to
      an earlier request, and therefore reference a RTP stream that is
      being received by the message recipient.

      If the RTCP packet is a feedback request that includes target
      SSRC(s), for each target SSRC that is found in the outgoing SSRC
      table, deliver a copy of the RTCP packet to the "m=" section
      associated with that SSRC.  PSFB and RTPFB types that are handled
      in this way include:

      Full Intra Request (FIR):  [RFC5104] (PT=PSFB, FMT=4).

      Temporal-Spatial Trade-off Request (TSTR):  [RFC5104] (PT=PSFB,
         FMT=5).

      H.271 Video Back Channel Message (VBCM):  [RFC5104] (PT=PSFB,
         FMT=7).

      Temporary Maximum Media Bit Rate Request (TMMBR):  [RFC5104]
         (PT=RTPFB, FMT=3).

      Layer Refresh Request (LRR):  [I-D.ietf-avtext-lrr] (PT=PSFB,
         FMT=TBD).

      If the RTCP packet is a feedback notification that includes target
      SSRC(s), for each target SSRC that is found in the incoming SSRC
      table, deliver a copy of the RTCP packet to the "m=" section
      associated with the RTP stream with matching SSRC.  PSFB and RTPFB
      types that are handled in this way include:

      Temporal-Spatial Trade-off Notification (TSTN):  [RFC5104]
         (PT=PSFB, FMT=6).  This message is a notification in response
         to a prior TSTR.

      Temporary Maximum Media Bit Rate Notification (TMMBN):  [RFC5104]
         (PT=RTPFB, FMT=4).  This message is a notification in response
         to a prior TMMBR, but can also be sent unsolicited.

      If the RTCP packet is of type APP, then it is handled in an
      application specific manner.  If the application does not
      recognise the APP packet, then it MUST be discarded.







Holmberg, et al.          Expires June 16, 2018                [Page 27]

Internet-Draft                Bundled media                December 2017


10.3.  RTP/RTCP Multiplexing

   Within a BUNDLE group, the offerer and answerer MUST enable RTP/RTCP
   multiplexing [RFC5761] for the RTP-based media specified by the
   BUNDLE group.

   When RTP/RTCP multiplexing is enabled, the same transport will be
   used for both RTP packets and RTCP packets associated with the BUNDLE
   group.

10.3.1.  SDP Offer/Answer Procedures

   This section describes how an offerer and answerer use the SDP 'rtcp-
   mux' attribute [RFC5761] and the SDP 'rtcp-mux-only' attribute
   [I-D.ietf-mmusic-mux-exclusive] to negotiate usage of RTP/RTCP
   multiplexing for RTP-based media associated with a BUNDLE group.

   The mux category [I-D.ietf-mmusic-sdp-mux-attributes] of the SDP
   'rtcp-mux' and 'rtcp-mux-only' attributes is IDENTICAL.  Section 8.1
   describes the details regarding which bundled "m=" sections an
   offerer and answerer associates the attributes with.

   RTP/RTCP multiplexing only applies to RTP-based media.  However, as
   described in Section 8.1, within a BUNDLE group the SDP 'rtcp-mux'
   and SDP 'rtcp-mux-only' attributes might be included in a non-RTP-
   based bundled "m=" section (if such "m=" line is represented by a
   BUNDLE-tag).

10.3.1.1.  Generating the Initial SDP Offer

   When an offerer generates an initial offer, if the offer contains one
   or more RTP-based bundled "m=" sections (or, if there is a chance
   that RTP-based "m=" sections will later be added to the BUNDLE
   group), the offerer MUST include an SDP 'rtcp-mux' attribute
   [RFC5761] in each bundled "m=" section (excluding any bundle-only
   "m=" sections), following the procedures for IDENTICAL mux category
   attributes in Section 8.1.  In addition, the offerer MAY include an
   SDP 'rtcp-mux-only' attribute [I-D.ietf-mmusic-mux-exclusive] in a
   RTP-based bundled "m=" section.

   NOTE: Whether the offerer associates the SDP 'rtcp-mux-only'
   attribute depends on whether the offerer supports fallback to usage
   of a separate port for RTCP in case the answerer moves one or more
   RTP-based "m=" section out of the BUNDLE group in the answer.

   NOTE: If the offerer includes an SDP 'rtcp-mux' attribute in the
   bundled "m=" sections, but does not include an SDP 'rtcp-mux-only'
   attribute, the offerer can also include an SDP 'rtcp' attribute



Holmberg, et al.          Expires June 16, 2018                [Page 28]

Internet-Draft                Bundled media                December 2017


   [RFC3605] in one or more RTP-based bundled "m=" sections in order to
   provide a fallback port for RTCP, as described in [RFC5761].
   However, the fallback port will only be used for RTP-based "m="
   sections moved out of the BUNDLE group by the answerer.

   In the initial offer, the address:port combination for RTCP MUST be
   unique in each bundled RTP-based "m=" section (excluding a bundle-
   only "m=" section), similar to RTP.

10.3.1.2.  Generating the SDP Answer

   When an answerer generates an answer, if the answerer supports RTP-
   based media, and if a bundled "m=" section in the offer contained an
   SDP 'rtcp-mux' attribute, the answerer MUST enable usage of RTP/RTCP
   multiplexing, even if there currently are no RTP-based "m=" sections
   within the BUNDLE group.  The answerer MUST include an SDP 'rtcp-mux'
   attribute in the bundled "m=" section represented by the answerer
   BUNDLE-tag, following the procedures for IDENTICAL mux category
   attributes in Section 8.1.  In addition, if the "m=" section in the
   offer contained an SDP "rtcp-mux-only" attribute, the answerer MUST
   include an SDP "rtcp-mux-only" attribute in the bundled "m=" section
   represented by the answerer BUNDLE-tag in the answer.

   If the "m=" section represented by the offerer BUNDLE-tag in the
   offer contained an SDP 'rtcp-mux-only' attribute, and if the answerer
   moves an RTP-based "m=" section out of the BUNDLE group in the answer
   [Section 8.3.3], the answerer MUST either include the attribute in
   the moved "m=" section (and enable RTP/RTCP multiplexing for the
   media associated with the "m=" section), or reject the "m=" section
   [Section 8.3.4].

   The answerer MUST NOT include an SDP 'rtcp' attribute in any "m="
   section within the BUNDLE group in the answer.  The answerer will use
   the port value of the selected offerer BUNDLE address for sending RTP
   and RTCP packets associated with each RTP-based bundled "m=" section
   towards the offerer.

   If the usage of RTP/RTCP multiplexing within a BUNDLE group has been
   negotiated in a previous offer/answer exchange, the answerer MUST
   include an SDP 'rtcp-mux' attribute in the "m=" section associated
   with the answerer BUNDLE-tag in the answer.  It is not possible to
   disable RTP/RTCP multiplexing within a BUNDLE group.

10.3.1.3.  Offerer Processing of the SDP Answer

   When an offerer receives an answer, if the answerer has accepted the
   usage of RTP/RTCP multiplexing (see Section 10.3.1.2), the answerer
   follows the procedures for RTP/RTCP multiplexing defined in



Holmberg, et al.          Expires June 16, 2018                [Page 29]

Internet-Draft                Bundled media                December 2017


   [RFC5761].  The offerer will use the port value associated with the
   answerer BUNDLE address for sending RTP and RTCP packets associated
   with each RTP-based bundled "m=" section towards the answerer.

   NOTE: It is considered a protocol error if the answerer has not
   accepted the usage of RTP/RTCP multiplexing for RTP-based "m="
   sections that the answerer included in the BUNDLE group.

10.3.1.4.  Modifying the Session

   When an offerer generates a subsequent offer, the offerer MUST
   include an SDP 'rtcp-mux' attribute in the bundled "m=" section
   represented by the offerer BUNDLE-tag, following the procedures for
   IDENTICAL mux category attributes in Section 8.1.

11.  ICE Considerations

   This section describes how to use the BUNDLE grouping extension
   together with the Interactive Connectivity Establishment (ICE)
   mechanism [I-D.ietf-ice-rfc5245bis].

   The generic procedures for negotiating usage of ICE using SDP,
   defined in [I-D.ietf-mmusic-ice-sip-sdp], also apply to usage of ICE
   with BUNDLE, with the following exceptions:

   o  When the BUNDLE transport has been established, ICE connectivity
      checks and keep-alives only need to be performed for the BUNDLE
      transport, instead of per individual "m=" section within the
      BUNDLE group.

   o  In an offer, if the offer assigns a unique address to one or more
      bundled "m=" sections (excluding any bundle-only "m=" sections),
      the offerer MUST include ICE-related media-level attributes in
      each of those "m=" sections.  If the offerer assigns an offerer
      BUNDLE address (previously selected [Section 8.3.1] or new
      suggested [Section 8.5.1]) to a bundled "m=" section (the "m="
      section represented by the offerer BUNDLE-tag), the offerer only
      includes ICE-related media-level SDP attributes in that "m="
      section, following the procedures in Section 8.1.

   o  In an answer, the answerer only includes ICE-related media-level
      SDP attributes in the bundled "m=" section to which the answerer
      has assigned the answerer BUNDLE address (the "m=" section
      represented by the answerer BUNDLE-tag), following the procedures
      in Section 8.1.

   Initially, before ICE has produced a candidate pair that will be used
   for media, there might be multiple transports established (if



Holmberg, et al.          Expires June 16, 2018                [Page 30]

Internet-Draft                Bundled media                December 2017


   multiple candidate pairs are tested).  Once ICE has produced a
   transport that will be used for media, that becomes the BUNDLE
   transport.

   Support and usage of ICE mechanism together with the BUNDLE extension
   is OPTIONAL, and the procedures in this section only apply when the
   ICE mechanism is used.

11.1.  SDP Offer/Answer Procedures

   When an offerer assigns a unique address to one or more bundled "m="
   sections (excluding any bundle-only "m=" section), the offerer MUST
   include SDP 'candidate' attributes (and other applicable ICE-related
   media-level SDP attributes), containing unique ICE properties
   (candidates etc), in each of those "m=" sections, following the
   procedures in [I-D.ietf-mmusic-ice-sip-sdp].

   When an offerer assigns a BUNDLE address (previously selected or new
   suggested) to a bundled "m=" section, (the "m=" section represented
   by the offerer BUNDLE-tag) the offerer MUST only include SDP
   'candidate' attributes (and other applicable ICE-related media-level
   SDP attributes) in that "m=" section, following the procedures in
   Section 8.1.

   When an answerer assigns a BUNDLE address to an "m=" section within a
   BUNDLE group (the "m=" section represented by the answerer BUNDLE-
   tag), the answerer MUST only include SDP 'candidate' attributes (and
   other applicable ICE-related media-level SDP attributes) in that "m="
   section, following the procedures in Section 8.1.

   NOTE: As most ICE-related media-level SDP attributes belong to the
   TRANSPORT mux category [I-D.ietf-mmusic-sdp-mux-attributes], the
   offerer and answerer follow the procedures in Section 8.1 when
   deciding whether to include an attribute in a bundled "m=" section.
   However, in the case of ICE-related media-level attributes, the rules
   apply to all attributes (see note below), even if they belong to a
   different mux category.

   NOTE: The following ICE-related media-level SDP attributes are
   defined in [I-D.ietf-mmusic-ice-sip-sdp]: 'candidate', 'remote-
   candidates', 'ice-mismatch', 'ice-ufrag', 'ice-pwd', and 'ice-
   pacing'.

12.  DTLS Considerations

   One or more media streams within a BUNDLE group might use the
   Datagram Transport Layer Security (DTLS) protocol [RFC6347] in order




Holmberg, et al.          Expires June 16, 2018                [Page 31]

Internet-Draft                Bundled media                December 2017


   to encrypt the data, or to negotiate encryption keys if another
   encryption mechanism is used to encrypt media.

   When DTLS is used within a BUNDLE group, the following rules apply:

   o  There can only be one DTLS association [RFC6347] associated with
      the BUNDLE group; and

   o  Each usage of the DTLS association within the BUNDLE group MUST
      use the same mechanism for determining which endpoints (the
      offerer or answerer) become DTLS client and DTLS server; and

   o  Each usage of the DTLS association within the BUNDLE group MUST
      use the same mechanism for determining whether an offer or answer
      will trigger the establishment of a new DTLS association, or
      whether an existing DTLS association will be used; and

   o  If the DTLS client supports DTLS-SRTP [RFC5764] it MUST include
      the 'use_srtp' extension [RFC5764] in the DTLS ClientHello message
      [RFC5764].  The client MUST include the extension even if the
      usage of DTLS-SRTP is not negotiated as part of the multimedia
      session (e.g., SIP session [RFC3261].

   NOTE: The inclusion of the 'use_srtp' extension during the initial
   DTLS handshake ensures that a DTLS renegotiation will not be required
   in order to include the extension, in case DTLS-SRTP encrypted media
   is added to the BUNDLE group later during the multimedia session.

13.  RTP Header Extensions Consideration

   When [RFC8285] RTP header extensions are used in the context of this
   specification, the identifier used for a given extension MUST
   identify the same extension across all the bundled media
   descriptions.

14.  Update to RFC 3264

   This section replaces the text of the following sections of RFC 3264:

   o  Section 5.1 (Unicast Streams).

   o  Section 6 (Generating the Answer).

   o  Section 8.2 (Removing a Media Stream).

   o  Section 8.4 (Putting a Unicast Media Stream on Hold).





Holmberg, et al.          Expires June 16, 2018                [Page 32]

Internet-Draft                Bundled media                December 2017


14.1.  Original text of section 5.1 (2nd paragraph) of RFC 3264

   For recvonly and sendrecv streams, the port number and address in the
   offer indicate where the offerer would like to receive the media
   stream.  For sendonly RTP streams, the address and port number
   indirectly indicate where the offerer wants to receive RTCP reports.
   Unless there is an explicit indication otherwise, reports are sent to
   the port number one higher than the number indicated.  The IP address
   and port present in the offer indicate nothing about the source IP
   address and source port of RTP and RTCP packets that will be sent by
   the offerer.  A port number of zero in the offer indicates that the
   stream is offered but MUST NOT be used.  This has no useful semantics
   in an initial offer, but is allowed for reasons of completeness,
   since the answer can contain a zero port indicating a rejected stream
   (Section 6).  Furthermore, existing streams can be terminated by
   setting the port to zero (Section 8).  In general, a port number of
   zero indicates that the media stream is not wanted.

14.2.  New text replacing section 5.1 (2nd paragraph) of RFC 3264

   For recvonly and sendrecv streams, the port number and address in the
   offer indicate where the offerer would like to receive the media
   stream.  For sendonly RTP streams, the address and port number
   indirectly indicate where the offerer wants to receive RTCP reports.
   Unless there is an explicit indication otherwise, reports are sent to
   the port number one higher than the number indicated.  The IP address
   and port present in the offer indicate nothing about the source IP
   address and source port of RTP and RTCP packets that will be sent by
   the offerer.  A port number of zero in the offer by default indicates
   that the stream is offered but MUST NOT be used, but an extension
   mechanism might specify different semantics for the usage of a zero
   port value.  Furthermore, existing streams can be terminated by
   setting the port to zero (Section 8).  In general, a port number of
   zero by default indicates that the media stream is not wanted.

14.3.  Original text of section 6 (4th paragraph) of RFC 3264

   An offered stream MAY be rejected in the answer, for any reason.  If
   a stream is rejected, the offerer and answerer MUST NOT generate
   media (or RTCP packets) for that stream.  To reject an offered
   stream, the port number in the corresponding stream in the answer
   MUST be set to zero.  Any media formats listed are ignored.  At least
   one MUST be present, as specified by SDP.








Holmberg, et al.          Expires June 16, 2018                [Page 33]

Internet-Draft                Bundled media                December 2017


14.4.  New text replacing section 6 (4th paragraph) of RFC 3264

   An offered stream MAY be rejected in the answer, for any reason.  If
   a stream is rejected, the offerer and answerer MUST NOT generate
   media (or RTCP packets) for that stream.  A port number of zero in
   the answer by default indicates that the offered stream is rejected,
   but an extension mechanism might specify different semantics for the
   usage of a zero port value.  If a stream is rejected, any media
   formats listed are ignored.  At least one MUST be present, as
   specified by SDP.

14.5.  Original text of section 8.2 (2nd paragraph) of RFC 3264

   A stream that is offered with a port of zero MUST be marked with port
   zero in the answer.  Like the offer, the answer MAY omit all
   attributes present previously, and MAY list just a single media
   format from amongst those in the offer.

14.6.  New text replacing section 8.2 (2nd paragraph) of RFC 3264

   A stream that is offered with a port of zero MUST by default be
   marked with port zero in the answer, unless an extension mechanism,
   which specifies semantics for the usage of a non-zero port value, is
   used.  If the stream is marked with port zero in the answer, the
   answer MAY omit all attributes present previously, and MAY list just
   a single media format from amongst those in the offer.

14.7.  Original text of section 8.4 (6th paragraph) of RFC 3264

   RFC 2543 [10] specified that placing a user on hold was accomplished
   by setting the connection address to 0.0.0.0.  Its usage for putting
   a call on hold is no longer recommended, since it doesn't allow for
   RTCP to be used with held streams, doesn't work with IPv6, and breaks
   with connection oriented media.  However, it can be useful in an
   initial offer when the offerer knows it wants to use a particular set
   of media streams and formats, but doesn't know the addresses and
   ports at the time of the offer.  Of course, when used, the port
   number MUST NOT be zero, which would specify that the stream has been
   disabled.  An agent MUST be capable of receiving SDP with a
   connection address of 0.0.0.0, in which case it means that neither
   RTP nor RTCP should be sent to the peer.

14.8.  New text replacing section 8.4 (6th paragraph) of RFC 3264

   RFC 2543 [10] specified that placing a user on hold was accomplished
   by setting the connection address to 0.0.0.0.  Its usage for putting
   a call on hold is no longer recommended, since it doesn't allow for
   RTCP to be used with held streams, doesn't work with IPv6, and breaks



Holmberg, et al.          Expires June 16, 2018                [Page 34]

Internet-Draft                Bundled media                December 2017


   with connection oriented media.  However, it can be useful in an
   initial offer when the offerer knows it wants to use a particular set
   of media streams and formats, but doesn't know the addresses and
   ports at the time of the offer.  Of course, when used, the port
   number MUST NOT be zero, if it would specify that the stream has been
   disabled.  However, an extension mechanism might specify different
   semantics of the zero port number usage.  An agent MUST be capable of
   receiving SDP with a connection address of 0.0.0.0, in which case it
   means that neither RTP nor RTCP should be sent to the peer.

15.  RTP/RTCP extensions for identification-tag transport

   SDP Offerers and Answerers [RFC3264] can associate identification-
   tags with "m=" sections within SDP Offers and Answers, using the
   procedures in [RFC5888].  Each identification-tag uniquely represents
   an "m=" section.

   This section defines a new RTCP SDES item [RFC3550], 'MID', which is
   used to carry identification-tags within RTCP SDES packets.  This
   section also defines a new RTP SDES header extension [RFC7941], which
   is used to carry the 'MID' RTCP SDES item in RTP packets.

   The SDES item and RTP SDES header extension make it possible for a
   receiver to associate each RTP stream with a specific "m=" section,
   with which the receiver has associated an identification-tag, even if
   those "m=" sections are part of the same RTP session.  The RTP SDES
   header extension also ensures that the media recipient gets the
   identification-tag upon receipt of the first decodable media and is
   able to associate the media with the correct application.

   A media recipient informs the media sender about the identification-
   tag associated with an "m=" section through the use of an 'mid'
   attribute [RFC5888].  The media sender then inserts the
   identification-tag in RTCP and RTP packets sent to the media
   recipient.

   NOTE: This text above defines how identification-tags are carried in
   SDP Offers and Answers.  The usage of other signaling protocols for
   carrying identification-tags is not prevented, but the usage of such
   protocols is outside the scope of this document.

   [RFC3550] defines general procedures regarding the RTCP transmission
   interval.  The RTCP MID SDES item SHOULD be sent in the first few
   RTCP packets sent after joining the session, and SHOULD be sent
   regularly thereafter.  The exact number of RTCP packets in which this
   SDES item is sent is intentionally not specified here, as it will
   depend on the expected packet loss rate, the RTCP reporting interval,
   and the allowable overhead.



Holmberg, et al.          Expires June 16, 2018                [Page 35]

Internet-Draft                Bundled media                December 2017


   The RTP SDES header extension for carrying the 'MID' RTCP SDES SHOULD
   be included in some RTP packets at the start of the session and
   whenever the SSRC changes.  It might also be useful to include the
   header extension in RTP packets that comprise access points in the
   media (e.g., with video I-frames).  The exact number of RTP packets
   in which this header extension is sent is intentionally not specified
   here, as it will depend on expected packet loss rate and loss
   patterns, the overhead the application can tolerate, and the
   importance of immediate receipt of the identification-tag.

   For robustness, endpoints need to be prepared for situations where
   the reception of the identification-tag is delayed, and SHOULD NOT
   terminate sessions in such cases, as the identification-tag is likely
   to arrive soon.

15.1.  RTCP MID SDES Item


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      MID=TBD  |     length    | identification-tag          ...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   The identification-tag payload is UTF-8 encoded, as in SDP.

   The identification-tag is not zero terminated.

   [RFC EDITOR NOTE: Please replace TBD with the assigned SDES
   identifier value.]

15.2.  RTP SDES Header Extension For MID

   The payload, containing the identification-tag, of the RTP SDES
   header extension element can be encoded using either the one-byte or
   two-byte header [RFC7941].  The identification-tag payload is UTF-8
   encoded, as in SDP.

   The identification-tag is not zero terminated.  Note, that the set of
   header extensions included in the packet needs to be padded to the
   next 32-bit boundary using zero bytes [RFC8285].

   As the identification-tag is included in either an RTCP SDES item or
   an RTP SDES header extension, or both, there should be some
   consideration about the packet expansion caused by the
   identification-tag.  To avoid Maximum Transmission Unit (MTU) issues




Holmberg, et al.          Expires June 16, 2018                [Page 36]

Internet-Draft                Bundled media                December 2017


   for the RTP packets, the header extension's size needs to be taken
   into account when encoding the media.

   It is recommended that the identification-tag is kept short.  Due to
   the properties of the RTP header extension mechanism, when using the
   one-byte header, a tag that is 1-3 bytes will result in a minimal
   number of 32-bit words used for the RTP SDES header extension, in
   case no other header extensions are included at the same time.  Note,
   do take into account that some single characters when UTF-8 encoded
   will result in multiple octets.  The identification-tag MUST NOT
   contain any user information, and applications SHALL avoid generating
   the identification-tag using a pattern that enables application
   identification.

16.  IANA Considerations

16.1.  New SDES item

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   [RFC EDITOR NOTE: Please replace TBD with the assigned SDES
   identifier value.]

   This document adds the MID SDES item to the IANA "RTP SDES item
   types" registry as follows:


     Value:     TBD
     Abbrev.:   MID
     Name:      Media Identification
     Reference: RFCXXXX


16.2.  New RTP SDES Header Extension URI

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   This document defines a new extension URI in the RTP SDES Compact
   Header Extensions sub-registry of the RTP Compact Header Extensions
   registry sub-registry, according to the following data:









Holmberg, et al.          Expires June 16, 2018                [Page 37]

Internet-Draft                Bundled media                December 2017


     Extension URI: urn:ietf:params:rtp-hdrext:sdes:mid
     Description:   Media identification
     Contact:       christer.holmberg@ericsson.com
     Reference:     RFCXXXX

     The SDES item does not reveal privacy information about the users.
     It is simply used to associate RTP-based media with the correct SDP
     media description ("m=" section) in the SDP used to negotiate the
     media.

     The purpose of the extension is for the offerer to be able to
     associate received multiplexed RTP-based media before the offerer
     receives the associated SDP answer.


16.3.  New SDP Attribute

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   This document defines a new SDP media-level attribute, 'bundle-only',
   according to the following data:


     Attribute name:     bundle-only
     Type of attribute:  media
     Subject to charset: No
     Purpose:            Request a media description to be accepted
                         in the answer only if kept within a BUNDLE
                         group by the answerer.
     Appropriate values: N/A
     Contact name:       Christer Holmberg
     Contact e-mail:     christer.holmberg@ericsson.com
     Reference:          RFCXXXX
     Mux category:       NORMAL


16.4.  New SDP Group Semantics

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   This document registers the following semantics with IANA in the
   "Semantics for the "group" SDP Attribute" subregistry (under the
   "Session Description Protocol (SDP) Parameters" registry:






Holmberg, et al.          Expires June 16, 2018                [Page 38]

Internet-Draft                Bundled media                December 2017


       Semantics                              Token   Reference
       -------------------------------------  ------  ---------
       Media bundling                         BUNDLE  [RFCXXXX]


17.  Security Considerations

   The security considerations defined in [RFC3264] and [RFC5888] apply
   to the BUNDLE extension.  Bundle does not change which information,
   e.g., RTP streams, flows over the network, with the exception of the
   usage of the MID SDES item as discussed below.  Primarily it changes
   which addresses and ports, and thus in which (RTP) sessions the
   information is flowing.  This affects the security contexts being
   used and can cause previously separated information flows to share
   the same security context.  This has very little impact on the
   performance of the security mechanism of the RTP sessions.  In cases
   where one would have applied different security policies on the
   different RTP streams being bundled, or where the parties having
   access to the security contexts would have differed between the RTP
   streams, additional analysis of the implications are needed before
   selecting to apply BUNDLE.

   The identification-tag, independent of transport, RTCP SDES packet or
   RTP header extension, can expose the value to parties beyond the
   signaling chain.  Therefore, the identification-tag values MUST be
   generated in a fashion that does not leak user information, e.g.,
   randomly or using a per-bundle group counter, and SHOULD be 3 bytes
   or less, to allow them to efficiently fit into the MID RTP header
   extension.  Note that if implementations use different methods for
   generating identification-tags this could enable fingerprinting of
   the implementation making it vulnerable to targeted attacks.  The
   identification-tag is exposed on the RTP stream level when included
   in the RTP header extensions, however what it reveals of the RTP
   media stream structure of the endpoint and application was already
   possible to deduce from the RTP streams without the MID SDES header
   extensions.  As the identification-tag is also used to route the
   media stream to the right application functionality it is important
   that the value received is the one intended by the sender, thus
   integrity and the authenticity of the source are important to prevent
   denial of service on the application.  Existing SRTP configurations
   and other security mechanisms protecting the whole RTP/RTCP packets
   will provide the necessary protection.

   When the BUNDLE extension is used, the set of configurations of the
   security mechanism used in all the bundled media descriptions will
   need to be compatible so that they can be used simultaneously, at
   least per direction or endpoint.  When using SRTP this will be the
   case, at least for the IETF defined key-management solutions due to



Holmberg, et al.          Expires June 16, 2018                [Page 39]

Internet-Draft                Bundled media                December 2017


   their SDP attributes (a=crypto, a=fingerprint, a=mikey) and their
   classification in [I-D.ietf-mmusic-sdp-mux-attributes].

   The security considerations of "RTP Header Extension for the RTP
   Control Protocol (RTCP) Source Description Items" [RFC7941] requires
   that when RTCP is confidentiality protected, and that any SDES RTP
   header extension carrying an SDES item, such as the MID RTP header
   extension, is also protected using commensurate strength algorithms.
   However, assuming the above requirements and recommendations are
   followed, there are no known significant security risks with leaving
   the MID RTP header extension without confidentiality protection.
   Thus, the requirements in RFC 7941 MAY be ignored for the MID RTP
   header extension.  Security mechanisms for RTP/RTCP are discussed in
   Options for Securing RTP Sessions [RFC7201], for example SRTP
   [RFC3711] can provide the necessary security functions of ensuring
   the integrity and source authenticity.

18.  Examples

18.1.  Example: Bundle Address Selection

   The example below shows:

   o  An offer, in which the offerer assigns a unique address to each
      bundled "m=" section within the BUNDLE group.

   o  An answer, in which the answerer selects the offerer BUNDLE
      address, and then selects its own BUNDLE address (the answerer
      BUNDLE address) and assigns it to the bundled "m=" section
      represented by the answerer BUNDLE-tag.





















Holmberg, et al.          Expires June 16, 2018                [Page 40]

Internet-Draft                Bundled media                December 2017


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10002 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=rtcp-mux
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=bundle-only
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid






Holmberg, et al.          Expires June 16, 2018                [Page 41]

Internet-Draft                Bundled media                December 2017


18.2.  Example: BUNDLE Extension Rejected

   The example below shows:

   o  An offer, in which the offerer assigns a unique address to each
      bundled "m=" section within the BUNDLE group.

   o  An answer, in which the answerer rejects the offered BUNDLE group,
      and assigns a unique address to each "m=" section (following
      normal RFC 3264 procedures).









































Holmberg, et al.          Expires June 16, 2018                [Page 42]

Internet-Draft                Bundled media                December 2017


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10002 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=rtcp-mux
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       m=video 30000 RTP/AVP 32
       b=AS:1000
       a=rtcp-mux
       a=rtpmap:32 MPV/90000



18.3.  Example: Offerer Adds a Media Description to a BUNDLE Group

   The example below shows:





Holmberg, et al.          Expires June 16, 2018                [Page 43]

Internet-Draft                Bundled media                December 2017


   o  A subsequent offer (the BUNDLE group has been created as part of a
      previous offer/answer exchange), in which the offerer adds a new
      "m=" section, represented by the "zen" identification-tag, to a
      previously negotiated BUNDLE group, assigns the previously
      selected offerer BUNDLE address to the added "m=" section,
      represented by the offerer BUNDLE-tag.  To every other bundled
      "m=" section the offerer assigns a zero port value and includes an
      SDP 'bundle-only' attribute.

   o  An answer, in which the answerer assigns the answerer BUNDLE
      address to the bundled "m=" section represented by the answerer
      BUNDLE-tag.  To every other bundled "m=" section the answerer
      assigns a zero port value and includes an SDP 'bundle-only'
      attribute.


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE zen foo bar
       m=audio 0 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=bundle-only
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=bundle-only
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtcp-mux
       a=rtpmap:66 H261/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


   SDP Answer (2)



Holmberg, et al.          Expires June 16, 2018                [Page 44]

Internet-Draft                Bundled media                December 2017


       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE zen foo bar
       m=audio 0 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=bundle-only
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=bundle-only
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtcp-mux
       a=rtpmap:66 H261/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid



18.4.  Example: Offerer Moves a Media Description Out of a BUNDLE Group

   The example below shows:

   o  A subsequent offer (the BUNDLE group has been created as part of a
      previous offer/answer transaction), in which the offerer moves a
      bundled "m=" section, represented by the "zen" identification-tag,
      out of a BUNDLE group, assigns a unique address to the moved "m="
      section, and assigns the previously selected offerer BUNDLE
      address to another bundled "m=" section, represented by the
      offerer BUNDLE-tag.  To every other bundled "m=" section the
      offerer assigns a zero port value and includes an SDP 'bundle-
      only' attribute.

   o  An answer, in which the answerer moves the "m=" section out of the
      BUNDLE group, assigns a unique address to the moved "m=" section,
      and assigns the answerer BUNDLE address to the bundled "m="
      section represented by the answerer BUNDLE-tag.  To every other
      bundled "m=" section the answerer assigns a zero port value and
      includes an SDP 'bundle-only' attribute.




Holmberg, et al.          Expires June 16, 2018                [Page 45]

Internet-Draft                Bundled media                December 2017


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=bundle-only
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 50000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtcp-mux
       a=rtpmap:66 H261/90000


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=bundle-only



Holmberg, et al.          Expires June 16, 2018                [Page 46]

Internet-Draft                Bundled media                December 2017


       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 60000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtcp-mux
       a=rtpmap:66 H261/90000



18.5.  Example: Offerer Disables a Media Description Within a BUNDLE
       Group

   The example below shows:

   o  A subsequent offer (the BUNDLE group has been created as part of a
      previous offer/answer transaction), in which the offerer disables
      a bundled "m=" section represented by the "zen" identification-
      tag, within a BUNDLE group, assigns a zero port number to the
      disabled "m=" section, and assigns the offerer BUNDLE address to
      another bundled "m=" section, represented by the offerer BUNDLE-
      tag.  To every other bundled "m=" section the offerer assigns a
      zero port value and includes an SDP 'bundle-only' attribute.

   o  An answer, in which the answerer moves the disabled "m=" sections
      out of the BUNDLE group, assigns a zero port value to the disabled
      "m=" section, and assigns the answerer BUNDLE address to the
      bundled "m=" section represented by the answerer BUNDLE-tag.  To
      every other bundled "m=" section the answerer assigns a zero port
      value and includes an SDP 'bundle-only' attribute.


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid



Holmberg, et al.          Expires June 16, 2018                [Page 47]

Internet-Draft                Bundled media                December 2017


       m=video 0 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=bundle-only
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 66
       a=mid:zen
       a=rtpmap:66 H261/90000


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtcp-mux
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=bundle-only
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 66
       a=mid:zen
       a=rtpmap:66 H261/90000



19.  Acknowledgements

   The usage of the SDP grouping extension for negotiating bundled media
   is based on similar alternatives proposed by Harald Alvestrand and
   Cullen Jennings.  The BUNDLE extension described in this document is
   based on the different alternative proposals, and text (e.g., SDP
   examples) have been borrowed (and, in some cases, modified) from
   those alternative proposals.





Holmberg, et al.          Expires June 16, 2018                [Page 48]

Internet-Draft                Bundled media                December 2017


   The SDP examples are also modified versions from the ones in the
   Alvestrand proposal.

   Thanks to Paul Kyzivat, Martin Thomson, Flemming Andreasen, Thomas
   Stach, Ari Keranen, Adam Roach, Christian Groves, Roman Shpount,
   Suhas Nandakumar, Nils Ohlmeier, Jens Guballa, Raju Makaraju, Justin
   Uberti, Taylor Brandstetter, Byron Campen and Eric Rescorla for
   reading the text, and providing useful feedback.

   Thanks to Bernard Aboba, Cullen Jennings, Peter Thatcher, Justin
   Uberti, and Magnus Westerlund for providing the text for the section
   on RTP/RTCP stream association.

   Thanks to Magnus Westerlund, Colin Perkins and Jonathan Lennox for
   providing help and text on the RTP/RTCP procedures.

   Thanks to Spotify for providing music for the countless hours of
   document editing.

20.  Change Log

   [RFC EDITOR NOTE: Please remove this section when publishing]

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-43

   o  Changes based on WG chairs review.

   o  Text added in order to close GitHub issues by Taylor B.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-42

   o  Changes based on final WG review.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-41

   o  Update to section 6 o RFC 3264:

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/47

   o  Editorial clarification on BUNDLE address selection:

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/46

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-40

   o  Editorial changes and technical restrictions in order to make the
      specification more understandable:




Holmberg, et al.          Expires June 16, 2018                [Page 49]

Internet-Draft                Bundled media                December 2017


   o  https://github.com/cdh4u/draft-sdp-bundle/pull/45

   o  - BUNDLE address is only assigned to m- section represented by
      BUNDLE-tag.

   o  - bundle-only attribute also used in answers and subsequent
      offers.

   o  - Answerer cannot reject, or remove, the bundled m- section that
      contains the BUNDLE address.

   o  - ICE Offer/Answer sections removed, due to duplicated
      information.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-39

   o  Editorial terminology changes.

   o  RFC 5285 reference replaced by reference to RFC 8285.

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/44

   o  - Clarify that an m- section can not be moved between BUNDLE
      groups without first moving the m- section out of a BUNDLE group.

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/41

   o  - Addition of BUNDLE transport concept.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-38

   o  Changes to RTP streaming mapping section based on text from Colin
      Perkins.

   o  The following GitHub pull requests were merged:

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/34

   o  - Proposed updates to RTP processing

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/35

   o  - fixed reference to receiver-id section

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-37

   o  The following GitHub pull request was merged:




Holmberg, et al.          Expires June 16, 2018                [Page 50]

Internet-Draft                Bundled media                December 2017


   o  https://github.com/cdh4u/draft-sdp-bundle/pull/33

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-36

   o  The following GitHub pull requests were merged:

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/32

   o  - extmap handling in BUNDLE.

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/31

   o  - Additional Acknowledgement text added.

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/30

   o  - MID SDES item security procedures updated

   o  https://github.com/cdh4u/draft-sdp-bundle/pull/29

   o  - Appendix B of JSEP moved into BUNDLE.

   o  - Associating RTP/RTCP packets with SDP m- lines.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-35

   o  Editorial changes on RTP streaming mapping section based on
      comments from Colin Perkins.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-34

   o  RTP streams, instead of RTP packets, are associated with m- lines.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-33

   o  Editorial changes based on comments from Eric Rescorla and Cullen
      Jennings:

   o  - Changes regarding usage of RTP/RTCP multiplexing attributes.

   o  - Additional text regarding associating RTP/RTCP packets with SDP
      m- lines.

   o  - Reference correction.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-32





Holmberg, et al.          Expires June 16, 2018                [Page 51]

Internet-Draft                Bundled media                December 2017


   o  Editorial changes based on comments from Eric Rescorla and Cullen
      Jennings:

   o  - Justification for mechanism added to Introduction.

   o  - Clarify that the order of m- lines in the group:BUNDLE attribute
      does not have to be the same as the order in which the m- lines
      are listed in the SDP.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-31

   o  Editorial changes based on GitHub Pull requests by Martin Thomson:

   o  - https://github.com/cdh4u/draft-sdp-bundle/pull/2

   o  - https://github.com/cdh4u/draft-sdp-bundle/pull/1

   o  Editorial change based on comment from Diederick Huijbers (9th
      July 2016).

   o  Changes based on comments from Flemming Andreasen (21st June
      2016):

   o  - Mux category for SDP bundle-only attribute added.

   o  - Mux category considerations editorial clarification.

   o  - Editorial changes.

   o  RTP SDES extension according to draft-ietf-avtext-sdes-hdr-ext.

   o  Note whether Design Considerations appendix is to be kept removed:

   o  - Appendix is kept within document.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-30

   o  Indicating in the Abstract and Introduction that the document
      updates RFC 3264.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-29

   o  Change based on WGLC comment from Colin Perkins.

   o  - Clarify that SSRC can be reused by another source after a delay
      of 5 RTCP reporting intervals.

   o  Change based on WGLC comment from Alissa Cooper.



Holmberg, et al.          Expires June 16, 2018                [Page 52]

Internet-Draft                Bundled media                December 2017


   o  - IANA registry name fix.

   o  - Additional IANA registration information added.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-28

   o  - Alignment with exclusive mux procedures.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-27

   o  - Yet another terminology change.

   o  - Mux category considerations added.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-26

   o  - ICE considerations modified: ICE-related SDP attributes only
      added to the bundled m- line representing the selected BUNDLE
      address.

   o  - Reference to draft-ietf-mmusic-ice-sip-sdp added.

   o  - Reference to RFC 5245 replaced with reference to draft-ietf-ice-
      rfc5245bis.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-25

   o  - RTP/RTCP mux procedures updated with exclusive RTP/RTCP mux
      considerations.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-24

   o  - Reference and procedures associated with exclusive RTP/RTCP mux
      added

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-23

   o  - RTCP-MUX mandatory for bundled RTP m- lines

   o  - Editorial fixes based on comments from Flemming Andreasen

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-22

   o  - Correction of Ari's family name

   o  - Editorial fixes based on comments from Thomas Stach

   o  - RTP/RTCP correction based on comment from Magnus Westerlund



Holmberg, et al.          Expires June 16, 2018                [Page 53]

Internet-Draft                Bundled media                December 2017


   o  -- http://www.ietf.org/mail-archive/web/mmusic/current/
      msg14861.html

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-21

   o  - Correct based on comment from Paul Kyzivat

   o  -- 'received packets' replaced with 'received data'

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-20

   o  - Clarification based on comment from James Guballa

   o  - Clarification based on comment from Flemming Andreasen

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-19

   o  - DTLS Considerations section added.

   o  - BUNDLE semantics added to the IANA Considerations

   o  - Changes based on WGLC comments from Adam Roach

   o  -- http://www.ietf.org/mail-archive/web/mmusic/current/
      msg14673.html

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-18

   o  - Changes based on agreements at IETF#92

   o  -- BAS Offer removed, based on agreement at IETF#92.

   o  -- Procedures regarding usage of SDP "b=" line is replaced with a
      reference to to draft-ietf-mmusic-sdp-mux-attributes.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-17

   o  - Editorial changes based on comments from Magnus Westerlund.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-16

   o  - Modification of RTP/RTCP multiplexing section, based on comments
      from Magnus Westerlund.

   o  - Reference updates.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-15




Holmberg, et al.          Expires June 16, 2018                [Page 54]

Internet-Draft                Bundled media                December 2017


   o  - Editorial fix.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-14

   o  - Editorial changes.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-13

   o  Changes to allow a new suggested offerer BUNDLE address to be
      assigned to each bundled m- line.

   o  Changes based on WGLC comments from Paul Kyzivat

   o  - Editorial fixes

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-12

   o  Usage of SDP 'extmap' attribute added

   o  SDP 'bundle-only' attribute scoped with "m=" lines with a zero
      port value

   o  Changes based on WGLC comments from Thomas Stach

   o  - ICE candidates not assigned to bundle-only m- lines with a zero
      port value

   o  - Editorial changes

   o  Changes based on WGLC comments from Colin Perkins

   o  - Editorial changes:

   o  -- "RTP SDES item" -> "RTCP SDES item"

   o  -- "RTP MID SDES item" -> "RTCP MID SDES item"

   o  - Changes in section 10.1.1:

   o  -- "SHOULD NOT" -> "MUST NOT"

   o  -- Additional text added to the Note

   o  - Change to section 13.2:

   o  -- Clarify that mid value is not zero terminated

   o  - Change to section 13.3:



Holmberg, et al.          Expires June 16, 2018                [Page 55]

Internet-Draft                Bundled media                December 2017


   o  -- Clarify that mid value is not zero terminated

   o  -- Clarify padding

   o  Changes based on WGLC comments from Paul Kyzivat

   o  - Editorial changes:

   o  Changes based on WGLC comments from Jonathan Lennox

   o  - Editorial changes:

   o  - Defintion of SDP bundle-only attribute alligned with structure
      in 4566bis draft

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-11

   o  Editorial corrections based on comments from Harald Alvestrand.

   o  Editorial corrections based on comments from Cullen Jennings.

   o  Reference update (RFC 7160).

   o  Clarification about RTCP packet sending when RTP/RTCP multiplexing
      is not used (http://www.ietf.org/mail-archive/web/mmusic/current/
      msg13765.html).

   o  Additional text added to the Security Considerations.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-10

   o  SDP bundle-only attribute added to IANA Considerations.

   o  SDES item and RTP header extension added to Abstract and
      Introduction.

   o  Modification to text updating section 8.2 of RFC 3264.

   o  Reference corrections.

   o  Editorial corrections.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-09

   o  Terminology change: "bundle-only attribute assigned to m= line" to
      "bundle-only attribute associated with m= line".

   o  Editorial corrections.



Holmberg, et al.          Expires June 16, 2018                [Page 56]

Internet-Draft                Bundled media                December 2017


   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-08

   o  Editorial corrections.

   o  - "of"->"if" (8.3.2.5).

   o  - "optional"->"OPTIONAL" (9.1).

   o  - Syntax/ABNF for 'bundle-only' attribute added.

   o  - SDP Offer/Answer sections merged.

   o  - 'Request new offerer BUNDLE address' section added

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-07

   o  OPEN ISSUE regarding Receiver-ID closed.

   o  - RTP MID SDES Item.

   o  - RTP MID Header Extension.

   o  OPEN ISSUE regarding insertion of SDP 'rtcp' attribute in answers
      closed.

   o  - Indicating that, when rtcp-mux is used, the answerer MUST NOT
      include an 'rtcp' attribute in the answer, based on the procedures
      in section 5.1.3 of RFC 5761.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-06

   o  Draft title changed.

   o  Added "SDP" to section names containing "Offer" or "Answer".

   o  Editorial fixes based on comments from Paul Kyzivat
      (http://www.ietf.org/mail-archive/web/mmusic/current/
      msg13314.html).

   o  Editorial fixed based on comments from Colin Perkins
      (http://www.ietf.org/mail-archive/web/mmusic/current/
      msg13318.html).

   o  - Removed text about extending BUNDLE to allow multiple RTP
      sessions within a BUNDLE group.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-05




Holmberg, et al.          Expires June 16, 2018                [Page 57]

Internet-Draft                Bundled media                December 2017


   o  Major re-structure of SDP Offer/Answer sections, to align with RFC
      3264 structure.

   o  Additional definitions added.

   o  - Shared address.

   o  - Bundled "m=" line.

   o  - Bundle-only "m=" line.

   o  - Offerer suggested BUNDLE mid.

   o  - Answerer selected BUNDLE mid.

   o  Q6 Closed (IETF#88): An Offerer MUST NOT assign a shared address
      to multiple "m=" lines until it has received an SDP Answer
      indicating support of the BUNDLE extension.

   o  Q8 Closed (IETF#88): An Offerer can, before it knows whether the
      Answerer supports the BUNDLE extension, assign a zero port value
      to a 'bundle-only' "m=" line.

   o  SDP 'bundle-only' attribute section added.

   o  Connection data nettype/addrtype restrictions added.

   o  RFC 3264 update section added.

   o  Indicating that a specific payload type value can be used in
      multiple "m=" lines, if the value represents the same codec
      configuration in each "m=" line.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-04

   o  Updated Offerer procedures (http://www.ietf.org/mail-
      archive/web/mmusic/current/msg12293.html).

   o  Updated Answerer procedures (http://www.ietf.org/mail-
      archive/web/mmusic/current/msg12333.html).

   o  Usage of SDP 'bundle-only' attribute added.

   o  Reference to Trickle ICE document added.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-02





Holmberg, et al.          Expires June 16, 2018                [Page 58]

Internet-Draft                Bundled media                December 2017


   o  Mechanism modified, to be based on usage of SDP Offers with both
      different and identical port number values, depending on whether
      it is known if the remote endpoint supports the extension.

   o  Cullen Jennings added as co-author.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-01

   o  No changes.  New version due to expiration.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-00

   o  No changes.  New version due to expiration.

   Changes from draft-holmberg-mmusic-sdp-multiplex-negotiation-00

   o  Draft name changed.

   o  Harald Alvestrand added as co-author.

   o  "Multiplex" terminology changed to "bundle".

   o  Added text about single versus multiple RTP Sessions.

   o  Added reference to RFC 3550.

21.  References

21.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC3264]  Rosenberg, J. and H. Schulzrinne, "An Offer/Answer Model
              with Session Description Protocol (SDP)", RFC 3264,
              DOI 10.17487/RFC3264, June 2002,
              <https://www.rfc-editor.org/info/rfc3264>.

   [RFC3550]  Schulzrinne, H., Casner, S., Frederick, R., and V.
              Jacobson, "RTP: A Transport Protocol for Real-Time
              Applications", STD 64, RFC 3550, DOI 10.17487/RFC3550,
              July 2003, <https://www.rfc-editor.org/info/rfc3550>.







Holmberg, et al.          Expires June 16, 2018                [Page 59]

Internet-Draft                Bundled media                December 2017


   [RFC3605]  Huitema, C., "Real Time Control Protocol (RTCP) attribute
              in Session Description Protocol (SDP)", RFC 3605,
              DOI 10.17487/RFC3605, October 2003,
              <https://www.rfc-editor.org/info/rfc3605>.

   [RFC3711]  Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K.
              Norrman, "The Secure Real-time Transport Protocol (SRTP)",
              RFC 3711, DOI 10.17487/RFC3711, March 2004,
              <https://www.rfc-editor.org/info/rfc3711>.

   [RFC4566]  Handley, M., Jacobson, V., and C. Perkins, "SDP: Session
              Description Protocol", RFC 4566, DOI 10.17487/RFC4566,
              July 2006, <https://www.rfc-editor.org/info/rfc4566>.

   [RFC4961]  Wing, D., "Symmetric RTP / RTP Control Protocol (RTCP)",
              BCP 131, RFC 4961, DOI 10.17487/RFC4961, July 2007,
              <https://www.rfc-editor.org/info/rfc4961>.

   [RFC5761]  Perkins, C. and M. Westerlund, "Multiplexing RTP Data and
              Control Packets on a Single Port", RFC 5761,
              DOI 10.17487/RFC5761, April 2010,
              <https://www.rfc-editor.org/info/rfc5761>.

   [RFC5764]  McGrew, D. and E. Rescorla, "Datagram Transport Layer
              Security (DTLS) Extension to Establish Keys for the Secure
              Real-time Transport Protocol (SRTP)", RFC 5764,
              DOI 10.17487/RFC5764, May 2010,
              <https://www.rfc-editor.org/info/rfc5764>.

   [RFC5888]  Camarillo, G. and H. Schulzrinne, "The Session Description
              Protocol (SDP) Grouping Framework", RFC 5888,
              DOI 10.17487/RFC5888, June 2010,
              <https://www.rfc-editor.org/info/rfc5888>.

   [RFC6347]  Rescorla, E. and N. Modadugu, "Datagram Transport Layer
              Security Version 1.2", RFC 6347, DOI 10.17487/RFC6347,
              January 2012, <https://www.rfc-editor.org/info/rfc6347>.

   [RFC7941]  Westerlund, M., Burman, B., Even, R., and M. Zanaty, "RTP
              Header Extension for the RTP Control Protocol (RTCP)
              Source Description Items", RFC 7941, DOI 10.17487/RFC7941,
              August 2016, <https://www.rfc-editor.org/info/rfc7941>.

   [RFC8285]  Singer, D., Desineni, H., and R. Even, Ed., "A General
              Mechanism for RTP Header Extensions", RFC 8285,
              DOI 10.17487/RFC8285, October 2017,
              <https://www.rfc-editor.org/info/rfc8285>.




Holmberg, et al.          Expires June 16, 2018                [Page 60]

Internet-Draft                Bundled media                December 2017


   [I-D.ietf-ice-rfc5245bis]
              Keranen, A., Holmberg, C., and J. Rosenberg, "Interactive
              Connectivity Establishment (ICE): A Protocol for Network
              Address Translator (NAT) Traversal", draft-ietf-ice-
              rfc5245bis-15 (work in progress), November 2017.

   [I-D.ietf-mmusic-sdp-mux-attributes]
              Nandakumar, S., "A Framework for SDP Attributes when
              Multiplexing", draft-ietf-mmusic-sdp-mux-attributes-16
              (work in progress), December 2016.

   [I-D.ietf-mmusic-mux-exclusive]
              Holmberg, C., "Indicating Exclusive Support of RTP/RTCP
              Multiplexing using SDP", draft-ietf-mmusic-mux-
              exclusive-12 (work in progress), May 2017.

   [I-D.ietf-mmusic-ice-sip-sdp]
              Petit-Huguenin, M., Keranen, A., and S. Nandakumar,
              "Session Description Protocol (SDP) Offer/Answer
              procedures for Interactive Connectivity Establishment
              (ICE)", draft-ietf-mmusic-ice-sip-sdp-16 (work in
              progress), November 2017.

21.2.  Informative References

   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,
              A., Peterson, J., Sparks, R., Handley, M., and E.
              Schooler, "SIP: Session Initiation Protocol", RFC 3261,
              DOI 10.17487/RFC3261, June 2002,
              <https://www.rfc-editor.org/info/rfc3261>.

   [RFC3611]  Friedman, T., Ed., Caceres, R., Ed., and A. Clark, Ed.,
              "RTP Control Protocol Extended Reports (RTCP XR)",
              RFC 3611, DOI 10.17487/RFC3611, November 2003,
              <https://www.rfc-editor.org/info/rfc3611>.

   [RFC5104]  Wenger, S., Chandra, U., Westerlund, M., and B. Burman,
              "Codec Control Messages in the RTP Audio-Visual Profile
              with Feedback (AVPF)", RFC 5104, DOI 10.17487/RFC5104,
              February 2008, <https://www.rfc-editor.org/info/rfc5104>.

   [RFC4585]  Ott, J., Wenger, S., Sato, N., Burmeister, C., and J. Rey,
              "Extended RTP Profile for Real-time Transport Control
              Protocol (RTCP)-Based Feedback (RTP/AVPF)", RFC 4585,
              DOI 10.17487/RFC4585, July 2006,
              <https://www.rfc-editor.org/info/rfc4585>.





Holmberg, et al.          Expires June 16, 2018                [Page 61]

Internet-Draft                Bundled media                December 2017


   [RFC5576]  Lennox, J., Ott, J., and T. Schierl, "Source-Specific
              Media Attributes in the Session Description Protocol
              (SDP)", RFC 5576, DOI 10.17487/RFC5576, June 2009,
              <https://www.rfc-editor.org/info/rfc5576>.

   [RFC7160]  Petit-Huguenin, M. and G. Zorn, Ed., "Support for Multiple
              Clock Rates in an RTP Session", RFC 7160,
              DOI 10.17487/RFC7160, April 2014,
              <https://www.rfc-editor.org/info/rfc7160>.

   [RFC7201]  Westerlund, M. and C. Perkins, "Options for Securing RTP
              Sessions", RFC 7201, DOI 10.17487/RFC7201, April 2014,
              <https://www.rfc-editor.org/info/rfc7201>.

   [RFC7656]  Lennox, J., Gross, K., Nandakumar, S., Salgueiro, G., and
              B. Burman, Ed., "A Taxonomy of Semantics and Mechanisms
              for Real-Time Transport Protocol (RTP) Sources", RFC 7656,
              DOI 10.17487/RFC7656, November 2015,
              <https://www.rfc-editor.org/info/rfc7656>.

   [I-D.ietf-ice-trickle]
              Ivov, E., Rescorla, E., Uberti, J., and P. Saint-Andre,
              "Trickle ICE: Incremental Provisioning of Candidates for
              the Interactive Connectivity Establishment (ICE)
              Protocol", draft-ietf-ice-trickle-15 (work in progress),
              November 2017.

   [I-D.ietf-avtext-lrr]
              Lennox, J., Hong, D., Uberti, J., Holmer, S., and M.
              Flodman, "The Layer Refresh Request (LRR) RTCP Feedback
              Message", draft-ietf-avtext-lrr-07 (work in progress),
              July 2017.

Appendix A.  Design Considerations

   One of the main issues regarding the BUNDLE grouping extensions has
   been whether, in SDP Offers and SDP Answers, the same port value
   should be inserted in "m=" lines associated with a BUNDLE group, as
   the purpose of the extension is to negotiate the usage of a single
   transport for media specified by the "m=" sections.  Issues with both
   approaches, discussed in the Appendix have been raised.  The outcome
   was to specify a mechanism which uses SDP Offers with both different
   and identical port values.

   Below are the primary issues that have been considered when defining
   the "BUNDLE" grouping extension:

   o  1) Interoperability with existing UAs.



Holmberg, et al.          Expires June 16, 2018                [Page 62]

Internet-Draft                Bundled media                December 2017


   o  2) Interoperability with intermediary Back to Back User Agent
      (B2BUA) and proxy entities.

   o  3) Time to gather, and the number of, ICE candidates.

   o  4) Different error scenarios, and when they occur.

   o  5) SDP Offer/Answer impacts, including usage of port number value
      zero.

A.1.  UA Interoperability

   Consider the following SDP Offer/Answer exchange, where Alice sends
   an SDP Offer to Bob:


   SDP Offer

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       m=audio 10000 RTP/AVP 97
       a=rtpmap:97 iLBC/8000
       m=video 10002 RTP/AVP 97
       a=rtpmap:97 H261/90000




   SDP Answer

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       m=audio 20000 RTP/AVP 97
       a=rtpmap:97 iLBC/8000
       m=video 20002 RTP/AVP 97
       a=rtpmap:97 H261/90000


   RFC 4961 specifies a way of doing symmetric RTP but that is a later
   extension to RTP and Bob can not assume that Alice supports RFC 4961.
   This means that Alice may be sending RTP from a different port than
   10000 or 10002 - some implementations simply send the RTP from an



Holmberg, et al.          Expires June 16, 2018                [Page 63]

Internet-Draft                Bundled media                December 2017


   ephemeral port.  When Bob's endpoint receives an RTP packet, the only
   way that Bob knows if it should be passed to the video or audio codec
   is by looking at the port it was received on.  This led some SDP
   implementations to use the fact that each "m=" section had a
   different port number to use that port number as an index to find the
   correct m line in the SDP.  As a result, some implementations that do
   support symmetric RTP and ICE still use an SDP data structure where
   SDP with "m=" sections with the same port such as:


   SDP Offer

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       m=audio 10000 RTP/AVP 97
       a=rtpmap:97 iLBC/8000
       m=video 10000 RTP/AVP 98
       a=rtpmap:98 H261/90000



   will result in the second "m=" section being considered an SDP error
   because it has the same port as the first line.

A.2.  Usage of Port Number Value Zero

   In an SDP Offer or SDP Answer, the media specified by an "m=" section
   can be disabled/rejected by setting the port number value to zero.
   This is different from e.g., using the SDP direction attributes,
   where RTCP traffic will continue even if the SDP "inactive" attribute
   is indicated for the associated "m=" section.

   If each "m=" section associated with a BUNDLE group would contain
   different port values, and one of those port values would be used for
   a BUNDLE address associated with the BUNDLE group, problems would
   occur if an endpoint wants to disable/reject the "m=" section
   associated with that port, by setting the port value to zero.  After
   that, no "m=" section would contain the port value which is used for
   the BUNDLE address.  In addition, it is unclear what would happen to
   the ICE candidates associated with the "m=" section, as they are also
   used for the BUNDLE address.







Holmberg, et al.          Expires June 16, 2018                [Page 64]

Internet-Draft                Bundled media                December 2017


A.3.  B2BUA And Proxy Interoperability

   Some back to back user agents may be configured in a mode where if
   the incoming call leg contains an SDP attribute the B2BUA does not
   understand, the B2BUA still generates that SDP attribute in the Offer
   for the outgoing call leg.  Consider a B2BUA that did not understand
   the SDP "rtcp" attribute, defined in RFC 3605, yet acted this way.
   Further assume that the B2BUA was configured to tear down any call
   where it did not see any RTCP for 5 minutes.  In this case, if the
   B2BUA received an Offer like:


   SDP Offer

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       m=audio 49170 RTP/AVP 0
       a=rtcp:53020



   It would be looking for RTCP on port 49171 but would not see any
   because the RTCP would be on port 53020 and after five minutes, it
   would tear down the call.  Similarly, a B2BUA that did not understand
   BUNDLE yet put BUNDLE in its offer may be looking for media on the
   wrong port and tear down the call.  It is worth noting that a B2BUA
   that generated an Offer with capabilities it does not understand is
   not compliant with the specifications.

A.3.1.  Traffic Policing

   Sometimes intermediaries do not act as B2BUAs, in the sense that they
   don't modify SDP bodies, nor do they terminate SIP dialogs.  Still,
   however, they may use SDP information (e.g., IP address and port) in
   order to control traffic gating functions, and to set traffic
   policing rules.  There might be rules which will trigger a session to
   be terminated in case media is not sent or received on the ports
   retrieved from the SDP.  This typically occurs once the session is
   already established and ongoing.

A.3.2.  Bandwidth Allocation

   Sometimes intermediaries do not act as B2BUAs, in the sense that they
   don't modify SDP bodies, nor do they terminate SIP dialogs.  Still,
   however, they may use SDP information (e.g., codecs and media types)



Holmberg, et al.          Expires June 16, 2018                [Page 65]

Internet-Draft                Bundled media                December 2017


   in order to control bandwidth allocation functions.  The bandwidth
   allocation is done per "m=" section, which means that it might not be
   enough if media specified by all "m=" sections try to use that
   bandwidth.  That may either simply lead to bad user experience, or to
   termination of the call.

A.4.  Candidate Gathering

   When using ICE, a candidate needs to be gathered for each port.  This
   takes approximately 20 ms extra for each extra "m=" section due to
   the NAT pacing requirements.  All of this gathering can be overlapped
   with other things while e.g., a web-page is loading to minimize the
   impact.  If the client only wants to generate TURN or STUN ICE
   candidates for one of the "m=" lines and then use trickle ICE
   [I-D.ietf-ice-trickle] to get the non host ICE candidates for the
   rest of the "m=" sections, it MAY do that and will not need any
   additional gathering time.

   Some people have suggested a TURN extension to get a bunch of TURN
   allocations at once.  This would only provide a single STUN result so
   in cases where the other end did not support BUNDLE, it may cause
   more use of the TURN server but would be quick in the cases where
   both sides supported BUNDLE and would fall back to a successful call
   in the other cases.

Authors' Addresses

   Christer Holmberg
   Ericsson
   Hirsalantie 11
   Jorvas  02420
   Finland

   Email: christer.holmberg@ericsson.com


   Harald Tveit Alvestrand
   Google
   Kungsbron 2
   Stockholm  11122
   Sweden

   Email: harald@alvestrand.no








Holmberg, et al.          Expires June 16, 2018                [Page 66]

Internet-Draft                Bundled media                December 2017


   Cullen Jennings
   Cisco
   400 3rd Avenue SW, Suite 350
   Calgary, AB  T2P 4H2
   Canada

   Email: fluffy@iii.ca












































Holmberg, et al.          Expires June 16, 2018                [Page 67]
